{"features":[{"feature_idx":0,"name":"Unnamed: 0","type":{"dtype":"int64","_type":"Value"}},{"feature_idx":1,"name":"title","type":{"dtype":"string","_type":"Value"}},{"feature_idx":2,"name":"text","type":{"dtype":"string","_type":"Value"}},{"feature_idx":3,"name":"subject","type":{"dtype":"string","_type":"Value"}},{"feature_idx":4,"name":"date","type":{"dtype":"string","_type":"Value"}},{"feature_idx":5,"name":"label","type":{"dtype":"int64","_type":"Value"}}],"rows":[{"row_idx":0,"row":{"Unnamed: 0":2619,"title":"Ex-CIA head says Trump remarks on Russia interference 'disgraceful'","text":"Former CIA director John Brennan on Friday criticized as “disgraceful” President Donald Trump’s efforts to play down U.S. intelligence agencies’ assessment that Russia meddled in the 2016 U.S. election. Trump’s administration has been dogged by investigations into allegations of Russian interference in last year’s U.S. presidential election and possible ties with his campaign team. Speaking one day before his first meeting with Russian President Vladimir Putin in Hamburg earlier this month, Trump said he suspected Russian interference in the election but that no one knows for sure. “These types of comments are just disgraceful ... and the person who said them should be ashamed of himself,” said Brennan, CIA chief under former President Barack Obama, at the Aspen Security Forum. Special Counsel Robert Mueller and several U.S. congressional committees are investigating whether Russia interfered in the election and colluded with Trump’s campaign to try to swing the race in his favor over Democratic rival Hillary Clinton.  Those probes are focused almost exclusively on Moscow’s actions, lawmakers and intelligence officials have said, and no evidence has surfaced publicly implicating other countries. Moscow has denied any interference, and Trump has said that  his campaign did not collude with Russia. Brennan said he was disappointed by the president’s handling of security issues in his first six months in office. “I must say there are disappointments that I see in terms of what Mr. Trump is doing on the international stage that I think pose serious questions about how he is keeping safe our national security,” Brennan said. Speaking at the same event in Aspen, James Clapper, the former director of national intelligence under Obama, was also critical of Trump’s administration. Asked if Jared Kushner, Trump’s son-in-law and top adviser, should have his security clearance canceled for initially failing to list on a disclosure form contacts he had with Russians, Clapper said it should be suspended pending a review. “I do think the appropriate thing here is take a pause and at least suspend a clearance until you’ve had the opportunity to investigate and then decide whether the clearance should be restored or not,” Clapper told the same panel. Brennan and Clapper also criticized Trump’s remarks in a tweet earlier this year about U.S. spy agencies in which he accused them of practices reminiscent of Nazi Germany.  “That (tweet) was a terrible insulting affront not to me or John. We get paid the big bucks to take that. But I’m talking about the rank and file, the people in the trenches, men and women, the patriots in the intelligence community and that was completely inappropriate,” said Clapper.","subject":"politicsNews","date":"July 22, 2017 ","label":1},"truncated_cells":[]},{"row_idx":1,"row":{"Unnamed: 0":16043,"title":"YOU WON’T BELIEVE HIS PUNISHMENT! HISPANIC STORE OWNER Swindles Tax Payers Out Of $1,116,924.27 In Latest Food Stamp Scam","text":"How did this man come to OWN this store? There is no information on much about this fraudster except that he stole from Americans and is getting just a slap on the wrist. It s no wonder these people are repeat offenders!A hispanic store owner testified in court through a Spanish translator (Why no English?) that he swindled the American tax payers out of millions via food stamp fraud. Eduardo Leonardo plead guilty to stealing from the USDA by illegally exchanging over a million dollars of food stamp benefits for cash for over two years. I stole from the USDA and the Food and Nutrition Service,  Eduardo Leonardo said slowly in Spanish through a translator in Brooklyn Federal Court.  It was an exchange of benefits for cash. Leonardo, 57,  admitted to committing  food stamp  fraud between Oct. 2015 and March 2017 by giving customers cash in exchange for running their EBT cards for a higher amount, which the federal government would later reimburse.In one instance, an undercover witness from the USDA went into Super Economic and picked up a jar of peanut butter and jelly and crackers, totaling $5.48. The witness then asked Leonardo to exchange benefits for $200 cash and Leonardo charged an undercover EBT card $287.89 and gave the witness $200 in cash, making a $82.41 profit.The USDA lost a total of $1,116,924.27 in the transactions.The scammer has run his store, Super Economic One Way Supermarket out of 104-21 Glenwood Road in Canarsie since Dec. 2011. It became a registered SNAP business on May 25, 2012. Specifically I gave a discounted rate in cash in exchange for them [customers] allowing me to ring up the full amount,  Leonardo said to Judge Ann Donnelly.Remember Ann Donnelly?Supplemental Nutrition Assistance Program (SNAP) previously called the  food stamp program,  uses federal tax dollars to aid low-income households in buying affordable and nutritious food. EBT cards are used like debit cards, to swipe at special terminals in retail food stores to use the benefits in exchange for food.Between Nov. 2015 and Jan. 2017, Super Economic conducted more than 57,000 SNAP transactions totaling more than $1.5 million, according to court documents.About 8 transactions were made for $50 or more, an amount that USDA officials say is high for a store that size, which would normally conduct $15 average transactions.Leonardo is set to be sentenced on Oct. 31 and could face a maximum five years in prison WHAAAAT????THIS IS WHY THIS KEEPS HAPPENING!A man swindles more than a million dollars from Americans yet he gets only 5 years in prison? The punishment does not fit the crime!Via: Brooklyn Eagle","subject":"Government News","date":"Jun 19, 2017","label":0},"truncated_cells":[]},{"row_idx":2,"row":{"Unnamed: 0":876,"title":"Federal Reserve governor Powell's policy views, in his own words","text":"President Donald Trump on Thursday tapped Federal Reserve Governor Jerome Powell to become head of the U.S. central bank, promoting a soft-spoken centrist to replace Janet Yellen when her term expires in February 2018. In five years as a Fed Governor Jerome Powell has been a consistent, middle of the road voice, backing the consensus crafted by Fed chair Janet Yellen that interest rates should be raised slowly so labor markets could recover, that financial stability risks were muted, and that new regulations had made the economy safer. Following is a collection of quotes from select policy speeches he has delivered since 2015: On Rates:  “The financial crisis did significant damage to the productive capacity of our economy, and the damage was of a character, extent, and duration that cannot be fully known today…It seems plausible that at least part of this supply-side damage could be reversed if the economy enjoys a period of sustained growth.4 To encourage that outcome, as monetary policymakers consider removing accommodation, we should look for a little more proof than usual that labor markets are tightening or other supply-side constraints are binding.” - April 2015 speech to New York Council on Foreign Relations: (Graphic: U.S. labor market measures vs interest rates - reut.rs/2h7hsFx) On Financial Stability:  “The bottom line is that there has not been an excessive buildup of leverage, maturity transformation, or broadly unsustainable asset prices…Overall, I do not see leveraged finance markets as posing undue financial stability risks. And if risk-taking does not threaten financial stability, it is not the Fed’s job to stop people from losing (or making) money.”  - January 2017 speech to American Finance Association, Chicago  (Graphic: U.S. stocks and leverage - reut.rs/2iolCp6) On Regulation: “We have substantially increased the capital, liquidity, and other prudential requirements for large banking firms. These measures are not free. Higher capital requirements increase bank costs, and at least some of those costs will be passed along to bank customers and shareholders. But in the longer term, stronger prudential requirements for large banking firms will produce more sustainable credit availability and economic growth.” - June 2017 speech to Salzburg Global Seminar, Salzburg, Austria (Graphic: Commercial credit and bank profitability - reut.rs/2h8lfCm) On the Current Economy: “Risks to the forecast now seem more balanced than they have been for some time. In particular, the global picture has brightened as growth and inflation have broadly moved up for the first time in several years. Here at home, risks seem both moderate and balanced, including the downside risk of lower inflation and the upside risk of labor market overheating. The Committee has been patient in raising rates, and that patience has paid dividends…. If the economy performs about as expected, I would view it as appropriate to continue to gradually raise rates.” - June 2017 speech to the Economic Club of New York (Graphic: The inflation conundrum - reut.rs/2za4ltY) Other issues may confront Powell in his confirmation hearings and as chair, such as whether to keep the current system of paying banks interest on their reserves as the main method of setting short term interest rates, and whether to rely on monetary policy rules: On Reserve Interest:   “Simple to operate and has provided good control over the federal funds rate.” - June 2017 speech to the Economic Club of New York (Graphic: Bank reserves at the Fed - reut.rs/2z7Qdl8) On Policy Rules:  “I am unable to think of any critical, complex human activity that could be safely reduced to a simple summary equation. In particular, no major central bank uses policy rules in a prescriptive way, and it is hard to predict the consequences of requiring the FOMC to do so, as some have proposed. Policy should be systematic, but not automatic.” - February 2017 speech to the Forecasters Club of New York (Graphic: Monetary policy rules vs reality - reut.rs/2h7mMZE)","subject":"politicsNews","date":"November 2, 2017 ","label":1},"truncated_cells":[]},{"row_idx":3,"row":{"Unnamed: 0":19963,"title":"SCOUNDREL HILLARY SUPPORTER STARTS “TrumpLeaks” Campaign…Desperate Move!","text":"Hillary Clinton ally David Brock is offering to pay for new information on Donald Trump, hoping that damaging audio or video on the Republican presidential candidate will be submitted to his super PAC.Brock, founder of the left-wing Media Matters and operator of Correct the Record super PAC, recently posted the plea on Correct the Record s website and is referring to the project as  TrumpLeaks,  NBC News reported.Brock asked for video or audio of Trump that has yet to be released. One of the most important things for voters to evaluate in any election is the full measure of a candidate s views, ideas, and temperament over time,  the website states. In making a choice for president, voters must also consider how various candidates present themselves to the public and to the world. There are few things more important in that regard than access to video or audio in the form of prior television or radio interviews or more candid video from events a candidate may have attended. Brock s super PAC goes on to say they can offer compensation to anyone who has new video or audio that has been obtained legally.Read more: WFB","subject":"left-news","date":"Sep 17, 2016","label":0},"truncated_cells":[]},{"row_idx":4,"row":{"Unnamed: 0":10783,"title":"NANCY PELOSI ARROGANTLY DISMISSES Questions on Crooked Democrat IT Employees Under Investigation [Video]","text":"Pleading ignorance is a perfect ploy for Nancy Pelosi Who wouldn t believe she s clueless on pretty much everything. Pelosi claims she s been busy with lots of  things . That s laughable! This case is a big deal! Here s what The Daily Caller had to say about this stain on the Democrats:U.S. Capitol Police and other agencies are probing the cyber activities of three brothers who had jobs as congressional staffers at the office of information technology for lawmakers on the House Permanent Select Committee on Intelligence, The Daily Caller News Foundation first reported. Brothers Imran, Abid and Jamal Awan also provided their services for other Democratic members in the lower chamber.When they came under suspicion by law enforcement for accessing the House network without permission last February, they were all banned from accessing it. While some Democratic lawmakers dismissed Imran from their employ when the story, others, like Florida Democratic Rep. Debbie Wasserman Schultz kept him on.Are the Democrats helping these two men hide the evidence?","subject":"politics","date":"May 26, 2017","label":0},"truncated_cells":[]},{"row_idx":5,"row":{"Unnamed: 0":18522,"title":"EU's Tusk appealed to Rajoy to avoid escalation in Catalonia","text":"European Council President Donald Tusk appealed to Spanish Prime Minister Mariano Rajoy on Monday to seek ways to avoid escalation in Catalonia and the use of force following Sunday s independence referendum in the region. After speaking to Rajoy, Tusk tweeted:  Sharing his constitutional arguments, I appealed for finding ways to avoid further escalation and use of force.","subject":"worldnews","date":"October 2, 2017 ","label":1},"truncated_cells":[]},{"row_idx":6,"row":{"Unnamed: 0":270,"title":"Country Guitarist Who Survived Vegas Shooting Changes Mind On Gun Control: ‘How Wrong I Was’","text":"Caleb Keeter, a lifelong proponent of the Second Amendment, and guitarist for Texas country outfit the Josh Abbott Band has had a strong change of heart regarding gun control. What changed his stance was  the events of last night  in which a gunman opened fire killing 58 people and injuring 515 others, marking it as the deadliest mass shooting in U.S. history. While  thoughts and prayers  are offered by the masses after each deadly shooting, Keeter took it a step further, posting a lengthy message on Twitter to express his personal thoughts after the attack.Keeter, who survived the attack, wrote,  I ve been a proponent of the 2nd amendment my entire life. Until the events of last night.   I cannot express how wrong I was. We actually have members of our crew with [Concealed Handgun Licenses], and legal firearms on the bus,  Keeter continued.  They were useless. We couldn t touch them for fear police might think we were part of the massacre and shoot us. A small group (or one man) laid waste to a city with dedicated, fearless police officers desperately trying to help, because of access to an insane amount of fire power.Enough is enough.Writing my parents and the love of my life a goodbye last night and a living will because I felt like I wasn t going to live through the night was enough for me to realize that this is completely and totally out of hand. These rounds were just powerful enough that my crew guys just standing in close proximity of a victim shot by this f ing coward received shrapnel wounds.We need gun control RIGHT. NOW. My biggest regret is that I stubbornly didn t realize it until my brothers on the road and myself were threatened by it. We are unbelievably fortunate to not be among the number of victims killed or seriously wounded by this maniac.pic.twitter.com/0NFjHf3PW2  Caleb Keeter (@Calebkeeter) October 2, 2017Some Twitter users wondered about his change of heart. Why now instead of when a gunman opened fire in 2012, slaughtering twenty first-graders and six adults at the Sandy Hook elementary school.On Twitter user wrote,  It s frustrating that some don t call the fire dept until the blaze is at their own front door. But we need more ppl on our side. Welcome. Caleb admitted that he s done nothing about gun violence which has rocked our country for years, but said he would like to do something now. You are all absolutely correct,  he tweeted.  I saw this happening for years and did nothing. But I d like to do what I can now. You are all absolutely correct. I saw this happening for years and did nothing. But I'd like to do what I can now. https://t.co/5mYA7D90X3  Caleb Keeter (@Calebkeeter) October 2, 2017In another tweet, he wrote,  That being said, I ll not live in fear of anyone. We will regroup, we ll come back, and we ll rock your fu*king faces off. Bet on it. It s OK to be for the Second Amendment and for gun control.  Keeter has a set of brass balls to come out publicly like that in support of gun control as the country music industry has close ties with the National Rifle Association.Image via YouTube screen capture.","subject":"News","date":"October 2, 2017","label":0},"truncated_cells":[]},{"row_idx":7,"row":{"Unnamed: 0":7628,"title":"Clinton says 'there is no case here' in FBI email investigation","text":"Democratic presidential candidate Hillary Clinton said on Monday that she welcomed the FBI to look at the emails in the latest twist in the controversy over her use of a private server while she was secretary of state. “There is no case here,” Clinton said at a rally at Kent State University, telling supporters she was confident the FBI would reach the same conclusion as it did in a year-long investigation - that there were no grounds for any charges.","subject":"politicsNews","date":"October 31, 2016 ","label":1},"truncated_cells":[]},{"row_idx":8,"row":{"Unnamed: 0":9599,"title":"ABC NEWS REPORTS: Las Vegas Massacre Suspect’s Hard Drive Is MISSING From His Laptop","text":"The investigation into the Las Vegas massacre Stephen Paddock just keeps getting more and more strange. Since the shooting massacre that took the lives of 59, and injured hundreds of others in Las Vegas at the Rt. 91 country music festival, we ve seen several timeline changes, a lockdown of the Las Vegas coroner s office, a very strange protection around the  security guard  at the Mandalay Bay Casino and Resort, including an armed guard and a scripted appearance on the Ellen Show. And now like some of the most well-known mass shooters before him, Stephen Paddock s hard drive is missing ?ABC News  A laptop computer recovered from the Las Vegas hotel room where Stephen Paddock launched the deadliest mass shooting in U.S. history was missing its hard drive, depriving investigators of a potential key source of information on why he killed and maimed so many people, ABC News has learned.Paddock is believed to have removed the hard drive before fatally shooting himself, and the missing device has not yet been recovered, sources told ABC News.Investigators digging into Paddock s background also learned he purchased software designed to erase files from a hard drive, but without the hard drive to examine it is impossible to know if he ever used the software, one source said.The absence of substantial digital clues has left investigators struggling to piece together what triggered Paddock to kill 58 innocent concertgoers and injure more than 500 others on Oct. 1.Did Paddock remove the hard drive or is there something more to this story? Is there some connection to evidence being removed from laptops or cell phones from suspects of 3 of the most well-known mass shooting cases in America?According to ABC News (who dismisses this curious evidence as a casual coincidence):In 2007, Virginia Tech shooter Cho Seung Huiremoved the hard drive of his computer and disposed of his cell phone shortly before the massacre. Authorities even searched a pond for the missing digital media, but the devices were never recovered.The 2008 Northern Illinois shooter, Steven Kazmierczak, removed the SIM card from his phone and the hard drive from his laptop, and neither was recovered.In 2012, Sandy Hook shooter Adam Lanza had removed the hard drive from his computer and smashed it with a hammer or screwdriver.","subject":"politics","date":"Oct 25, 2017","label":0},"truncated_cells":[]},{"row_idx":9,"row":{"Unnamed: 0":11234,"title":"BONKERS BERNIE SANDERS: Prioritizing Jobs Over Climate Change Is ‘Stupid and Dangerous’ [Video]","text":"https://www.youtube.com/watch?v=GPqQIlWksbgVermont Sen. Bernard Sanders told CNN Thursday that President Trump s plan to prioritize job creation over climate change regulations is  stupid and dangerous.  The commander in chief signed an  Energy Independence  executive order Tuesday as a means of rolling back former President Barack Obama s Clean Power Plan. Mr. Trump said his policies will cause  wealth to pour into our communities,  although Mr. Sanders frames it as a recipe for environmental disaster.  [This plan is a] nonsensical, and stupid, and dangerous approach,  Mr. Sanders told CNN s Wolf Blitzer Thursday.  It s almost indescribable. Look, the scientific community is virtually unanimous. While Trump and his friends think climate change is a hoax, what the scientists are telling us it is real, it is caused by human activity. It is already causing devastating problems.  The Trump administration argues on the White House website that its actions will prevent $39 billion in electricity hikes, allow 242 million tons of coal to benefit the American economy, and disbands the Interagency Working Group on the Social Cost of Greenhouse Gases.  I am taking historic steps to lift restrictions on American energy, to reverse government intrusion and to cancel job-killing regulations,  Mr. Trump said Tuesday while surrounded by coal industry executives. Kentucky Coal Association President Tyler White cheered the move soon afterward.Read more: WT","subject":"politics","date":"Apr 1, 2017","label":0},"truncated_cells":[]},{"row_idx":10,"row":{"Unnamed: 0":8071,"title":"Trump opposes plan for U.S. to cede internet oversight","text":"U.S. Republican presidential nominee Donald Trump opposes a long-planned transition of oversight of the internet’s technical management from the U.S. government to a global community of stakeholders, his campaign said in a statement on Wednesday. Congress should block the handover, scheduled to occur on Oct. 1, “or internet freedom will be lost for good, since there will be no way to make it great again once it is lost,” Stephen Miller, national policy director for the Trump campaign, said in a statement. Senator Ted Cruz of Texas, a former presidential primary foe of Trump’s who has refused to endorse the real estate developer, has led a movement in Congress to block the transition, arguing it could cede control of the internet itself to authoritarian regimes like Russia and China and threaten online freedom. Technical experts have said those claims are baseless, and that a delay will backfire by undermining U.S. credibility in future international negotiations over internet standards and security. Publicly proposed in March 2014, the transfer of oversight of the nonprofit Internet Corporation for Assigned Names and Numbers, or ICANN, is expected to go forward unless Congress votes to block the move.  A vote to delay the transition may come as an amendment to a temporary spending bill that Congress must pass by Sept. 30 to prevent much of the federal government from shutting down. Congressional negotiators on Wednesday were working to finalize an agreement on the spending package. Democratic presidential candidate Hillary Clinton supports the Obama administration’s planned transition to a global community of technologists, civil society groups and internet users, according to policy positions available on her campaign website.","subject":"politicsNews","date":"September 21, 2016 ","label":1},"truncated_cells":[]},{"row_idx":11,"row":{"Unnamed: 0":6921,"title":"Putin says Trump clever, will understand new responsibilities","text":"U.S. President-elect Donald Trump is a clever man and will quickly understand his new responsibilities, Russian President Vladimir Putin said in an interview with NTV TV. Putin has spoken previously of his hope that Trump will help restore U.S.-Russia relations, and analysts said he was unlikely to want to dial up anti-Western rhetoric before Trump’s inauguration in January. “Trump was an entrepreneur and a businessman. He is already a statesman, he is the head of the United States of America, one of the world’s leading countries,” NTV quoted Putin as saying in the interview on www.ntv.ru on Sunday. “Because he achieved success in business, it suggests that he is a clever man. And if (he is) a clever man, then he will fully and quite quickly understand another level of responsibility. We assume that he will be acting from these positions,” Putin said. Putin’s comments appeared to address criticism from Trump’s opponents who say his unconventional actions since the election - including railing at the cast of a Broadway show and early-morning invective on Twitter - show Trump is out of his depth. China lodged a diplomatic protest on Saturday after Trump spoke by phone with President Tsai Ing-wen of Taiwan, the first by a U.S. president-elect or president since Jimmy Carter switched diplomatic recognition from Taiwan to China in 1979, acknowledging Taiwan as part of “one China”. Speaking about Russia’s relations with the West, Putin said attempts to create a unipolar world had failed: “The situation is changing. I think it is not a secret to anyone, everyone sees it, that many of our partners already prefer to stick to principles of international law, because the world’s balance is being gradually restored.” Putin said when building relationships with other countries, Russia would respect their interests.","subject":"politicsNews","date":"December 4, 2016 ","label":1},"truncated_cells":[]},{"row_idx":12,"row":{"Unnamed: 0":14878,"title":"Obama And Kerry Exposed: Secret Side Deals With Iran And No Nuclear Agreement","text":"Bravo! These two great Americans make me have hope for the politicians we elect. They re doing a damn good job of exposing the phony Iran deal. They both are veterans and super smart so maybe they ve been able to outsmart the Obama thugs. I love these guys!Rep. Mike Pompeo (R   Kan.) and Sen. Tom Cotton (R   Ark.) have a lot in common. Both are army veterans and both are graduates of Harvard Law School. And both have been doing a great job of exposing aspects of the nuclear deal with Iran that the administration would rather keep quiet.This week it was reported that an inquiry from Pompeo got the State Department to admit that the nuclear deal was never signed and is not  legally binding. Julia Frifield, the Assistant Secretary of State for Legislative Affairs, wrote in response to Pompeo s inquiry if he could see the signed agreement, in a letter reproduced at the congressman s website, that the nuclear deal was not binding and that it was not signed by any party. The key parts of the letter read:The Joint Comprehensive Plan of Action (JCPOA) is not a treaty or an executive agreement, and is not a signed document   The success of the JCPOA will depend not on whether it is legally binding or signed, but rather on the extensive verification measures we have put in place, as well as Iran s understanding that we have the capacity to re-impose   and ramp up   our sanctions if Iran does not meet its commitments.Frifield asserted that the JCPOA was not a signed agreement but  reflections of political commitments  between Iran and the P5+1 nations   the United States, Britain, France, China, Russia and Germany.Pompeo responded,  For the State Department to try to defend the unsigned and non-binding Iran nuclear agreement by calling it a  political commitment  is about as absurd as the terms of the deal itself.   Instead of forging an agreement with Iran that will protect Americans and prevent the world s largest state sponsor of terror from obtaining a nuclear weapon, the Obama administration caved to Iranian bullies and serial nuclear cheaters. Unsigned, this agreement is nothing more than a press release and just about as enforceable. Pompeo, of course, knew that the deal was unsigned, but he got the State Department to admit it. What Cotton s letter did was expose the administration s ploy to evade Congressional oversight and still achieve the permanence of a treaty by going to the U.N. Security Council.The non-binding nature of the nuclear non-agreement isn t the only subterfuge that Cotton and Pompeo have exposed. It was also their questioning that led to the discovery of the secret side deals between Iran and the IAEA. One of the side deals allowed Iran to collect its own samples at the Parchin military base, an arrangement that non-proliferation experts Olli Heinonen, a former deputy director of the IAEA, and David Albright, head of the Institute for Science and International Security, said undermined the effectiveness of the JCPOA. (The scandal of self-inspection of Parchin had previously been brought up by Sen. Robert Menendez (D   N.J.) and Sen. James Risch (R   Idaho).)Cotton and Pompeo have been very good at exposing the weakness of the deal that the media wouldn t otherwise have reported. No doubt in the coming months Iran will continue testing the administration and the administration will continue retreating exposing further weaknesses in the deal.","subject":"politics","date":"Nov 27, 2015","label":0},"truncated_cells":[]},{"row_idx":13,"row":{"Unnamed: 0":1560,"title":"Ex-N.Y. state senate leader's corruption conviction vacated, faces retrial","text":"A U.S. appeals court on Tuesday threw out the conviction of former New York state Senate Majority Leader Dean Skelos, citing a recent U.S. Supreme Court decision that narrowed the conduct that can sustain federal corruption charges. But the 2nd U.S. Circuit Court of Appeals said federal prosecutors can retry Skelos and his son, Adam Skelos, for bribery and fraud because the evidence presented at trial was “sufficient” to prove their case. The ruling came two months after the court also vacated the bribery conviction of former New York state Assembly Speaker Sheldon Silver, employing similar reasoning. Acting U.S. Attorney in Manhattan Joon Kim said in a statement that his office would pursue a “prompt retrial where we will have another opportunity to present the overwhelming evidence of Dean Skelos and Adam Skelos’ guilt.” Prosecutors previously said they would also retry Silver. Alexandra Shapiro, a lawyer for Skelos, said in an email: “We believe that as events unfold it is going to become clear that this is a case that never should have been brought.” The back-to-back convictions of Silver and Skelos, the state’s most powerful legislators, in November and December 2015 represented two of the most high-profile victories for former Manhattan U.S. Attorney Preet Bharara, who made public corruption a major focus during his tenure before he was fired by U.S. President Trump in March. Skelos, 69, a Republican, was sentenced to five years in prison in May 2016, while his son Adam was sentenced to 6-1/2 years. Both were free on bail at the time of Tuesday’s decision. Together with Governor Andrew Cuomo, Skelos and Silver were members of the “three men in a room” in the state capital of Albany that hold enormous sway over major legislation. The U.S. Supreme Court last year overturned the corruption conviction of former Virginia Governor Bob McDonnell, finding that routine acts such as setting up meetings or contacting other politicians did not qualify as “official acts” under federal bribery statutes. The 2nd Circuit said on Tuesday that the jury instructions at Skelos’ trial, which occurred before the McDonnell decision, were therefore improper, through no fault of the judge or the prosecutors. The elder Skelos was found guilty of using his position as Senate majority leader to pressure three companies seeking his political support into paying his son, including for a lucrative “no-show” job. In exchange, Skelos pushed through bills to benefit the companies, according to prosecutors. The case is U.S. v. Skelos et al, 2nd U.S. Circuit Court of Appeals, Nos. 16-1618 and 16-1697.","subject":"politicsNews","date":"September 26, 2017 ","label":1},"truncated_cells":[]},{"row_idx":14,"row":{"Unnamed: 0":13064,"title":"Venezuela's former ambassador to U.N. leaves the United States: source","text":"Venezuela s former ambassador to the United Nations, Rafael Ramirez, has left the United States after being forced to resign by President Nicolas Maduro s government, according to a source with knowledge of his travel plan. Ramirez, who for more than a decade ran OPEC member Venezuela s massive oil industry, said earlier on Tuesday he was removed because of his opinions.","subject":"worldnews","date":"December 5, 2017 ","label":1},"truncated_cells":[]},{"row_idx":15,"row":{"Unnamed: 0":15262,"title":"Trump's stop in Vietnam a poignant one for U.S. veterans","text":"Whether they like President Donald Trump or not, the U.S. veterans who gather at Hoa s Place in Danang show little concern that he avoided the war that marked their lives. Trump flies into the Vietnamese resort of Danang on Friday for a summit of Asia-Pacific leaders, landing in a city that for many Americans of his generation was their first sight of Vietnam - and of war.  He ll finally be able to put on his resume that he was in Vietnam,  said David Clark, 68, who is originally from Akron, Ohio and calls Trump  a joke . After serving in Vietnam from 1968 to 1969 with the Marine Corps, he has now returned to help with projects to address the legacy of the war. Trump never served in the military. He received five deferments during the Vietnam War, including one for bone spurs in his heel, the New York Times reported last year. The paper quoted Trump as saying the bones spurs had been  temporary .      Everyone I know tried to avoid it,  said draftee Keith Soukkala, sipping a beer at Hoa s Place, a favored bar of veterans near Danang s  China Beach .  I stayed out as long as I could but I didn t have any bone spurs,  said Soukkala, who splits his time between Vietnam and Alaska and said he voted for Trump. At 73, he is two years older than Trump and recalls landing in Danang to the humid heat and  a certain smell in the air  at the start of a 13-month tour with the Marine Corps dodging bombs hidden by the communist Viet Cong guerrillas. The seaside resort of Danang has a special place in U.S.-Vietnamese history: it was here that the first U.S. ground troops disembarked in 1965 in the escalation of a war that would last another decade before the communist victory. Close to some of the heaviest fighting in central Vietnam, Danang had a big U.S. air base. China Beach was a relaxation spot for U.S. soldiers back from combat. Now, Danang s beachfront hotels draw tourists from around the world. Gleaming office towers mark it out as one of Vietnam s most modern cities and one the communist government sought to showcase with the hosting of the Asia Pacific Economic Cooperation (APEC) summit which Trump will attend. It s also home to a community of U.S. veterans who returned to a country where a recent Pew Research survey showed the United States was viewed favorably by 84 percent of people. Clark came back in 2013 for a year and is still in Danang, busy with projects to destroy unexploded U.S. bombs and help families affected by the Agent Orange defoliant linked to illness and deformity. Mark O Connor, 67, of Sioux Falls, South Dakota, and once part of a helicopter assault team, visits as often as he can to provide bicycles to children in hill villages.      On this visit, though, he said he had come back in the hope of seeing Trump - his support unaffected by the fact the president had not served in Vietnam.  You know, more power to him,  he said.  You can t feel bad about him and not feel bad about everyone who went to Canada to avoid the draft.","subject":"worldnews","date":"November 9, 2017 ","label":1},"truncated_cells":[]},{"row_idx":16,"row":{"Unnamed: 0":6587,"title":"Trump 'arms race' comment sows more doubt on nuclear policy","text":"U.S. President-elect Donald Trump sowed more doubt about his position on nuclear proliferation on Friday, reportedly welcoming an arms race even as his spokesman insisted that an atomic weapons build-up was not likely to happen. Trump, who takes office on Jan. 20, caused alarm on Thursday on Twitter, saying the United States “must greatly strengthen and expand its nuclear capability until such time as the world comes to its senses regarding nukes.” On Friday, he had an off-air phone conversation about the tweet with MSNBC TV host Mika Brzezinski, who said Trump told her: “Let it be an arms race. We will outmatch them at every pass and outlast them all.” MSNBC did not play his comments on air. But Trump spokesman Sean Spicer said in a round of television interviews on Friday that Trump’s comments were meant to send a general message of strength to countries like Russia and China rather than indicate the United States planned to build up its nuclear capabilities. “He is going to do what it takes to protect this country and if another country or countries want to threaten our safety and sovereignty, he is going to do what it takes,” Spicer said on CNN. “If another country expands theirs (nuclear capability), the United States will act in kind ... But I do believe that it won’t happen because I think what they have seen, domestically and internationally, is this is a man of action,” Spicer said. Russian President Vladimir Putin, at his annual news conference in Moscow on Friday, said he saw nothing new or remarkable about Trump’s tweet on Thursday, and made clear he did not see the United States as a potential aggressor.  Kremlin spokesman Dmitry Peskov said on Friday that Russia has never initiated an arms race and never will, the RIA news agency reported. In an apparent attempt to calm any tensions about his nuclear comments, Trump said in a statement on Friday that he had received “a very nice letter” from Putin earlier this month calling for stronger relations between the two countries.     A nuclear arms race is diametrically opposed to decades of Republican orthodoxy that has called for cuts in U.S. nuclear weapons since the Ronald Reagan White House. Trump’s tweet prompted analysts to question whether Trump was threatening to abrogate the 2011 New START treaty, which limits deployed warheads and delivery systems - or would begin deploying other warheads. The United States is one of five nuclear weapons states allowed to keep a nuclear arsenal under the Nuclear Non-Proliferation Treaty. The others are Russia, Britain, France and China. The United States is in the midst of a $1 trillion, 30-year  modernization of its aging ballistic missile submarines, bombers and land-based missiles, a price tag that most experts say the U.S. cannot afford. Russia, also bound by the treaty limits, is also carrying out a modernization program but is not expanding its warhead stockpile. Twitter is Trump’s communication method of choice. But its 140-character limit does not lend itself well to talking about complex geopolitical issues like nuclear proliferation fraught with risk, analysts charged. “He must have leaders around the world trying to guess what he means,” Daryl Kimball, the executive director of the Arms Control Association, said on Thursday.  Shares of uranium producers and a nuclear fuel technology company have jumped on Trump’s comments with Uranium Resources Inc, Uranium Energy Corp, Cameco Corp and Lightbridge Corp all trading higher on Friday.","subject":"politicsNews","date":"December 22, 2016 ","label":1},"truncated_cells":[]},{"row_idx":17,"row":{"Unnamed: 0":11084,"title":"U.S. government committed to helping Flint, Michigan, fix water problem: White House","text":"The U.S. government is committed to helping Flint, Michigan, succeed in fixing the problems with its lead-contaminated water system, White House spokesman Josh Earnest said on Wednesday. “There are significant public health consequences” to the contaminated-water crisis in Flint, Earnest told a White House news briefing. A federal official from the Department of Health and Human Services is in Flint, coordinating the assistance being provided by the federal government, he added.","subject":"politicsNews","date":"January 27, 2016 ","label":1},"truncated_cells":[]},{"row_idx":18,"row":{"Unnamed: 0":20663,"title":"Taiwan's new premier vows to 'build country', scrap investment hurdles","text":"Taiwan s new premier, William Lai, vowed on Friday to work towards luring greater investment to the self-ruled island, while sticking to the policies of the ruling Democratic Progressive Party. Lai, formerly the mayor of the southwestern city of Tainan, made the remarks at a cabinet transition ceremony following the resignation this week of his predecessor, Lin Chuan..  The cabinet reshuffle, at a time of low public approval ratings for President Tsai Ing-wen, will give the government an opportunity to push through legislation with less resistance.  Ratings for Tsai shrank to below 30 percent by August, a survey by a private foundation showed, down from nearly 70 percent soon after her landslide election victory in 2016.  My main responsibility is to build the country, expand the economy and look after the people,  said Lai, adding that his cabinet would press on with reforms in areas ranging from the energy industry to labor, pensions and tax, while  eliminating obstacles for investment . He added,  these will have a pragmatic strategy and will be solved in a steadfast way.  Dissatisfaction with labor and pension reforms are seen to have weighed on Tsai s ratings, sparking occasional protests. The reshuffle brought several new key appointments, though most of the other ministry-level positions stayed unchanged.  The financial supervisory commission gets a new chief, Wellington Koo, while acting economics minister Shen Jong-chin was confirmed in the role. A new vice premier and secretary-general were also appointed to the cabinet, or executive yuan.   Lai, a member of Tsai s independence-leaning party, won a landslide reelection in 2014 in Tainan, home to the plants of Taiwan Semiconductor Manufacturing Co (TSMC) and other technology firms.  The Harvard-educated Lai is expected to take a cautious stance in the transition, as shown by his modest personnel changes, analysts say.    Lai brings an effective administrative style, and will seek to keep the agenda on track,  said Edward Yang, an associate professor at National Taiwan Normal University.  His popular style also contrasts with that of Lin, who was seen as a less effective communicator, Yang added. The DPP is striving to shore up its popularity ahead of local elections next year in which it faces off against its main rival, the China-friendly Kuomintang (KMT) party.  Local election results are seen as a harbinger for the presidential election in 2020.","subject":"worldnews","date":"September 8, 2017 ","label":1},"truncated_cells":[]},{"row_idx":19,"row":{"Unnamed: 0":13705,"title":"Kremlin: no firm date yet for proposed congress of Syria's peoples","text":"No firm date has been set yet for a Congress of Syria s peoples proposed by Russia, the Kremlin said on Tuesday, stressing that such a forum should be as inclusive as possible.  There is no clarity yet (on the date), no one is setting a task for himself to adjust this event to the New Year holidays or after them,  Kremlin spokesman Dmitry Peskov told a conference call with reporters.  The main thing is to properly prepare and agree the lists (of the participants) - this is precisely the hardest part of it.","subject":"worldnews","date":"November 28, 2017 ","label":1},"truncated_cells":[]},{"row_idx":20,"row":{"Unnamed: 0":20185,"title":"U.S. says air strikes in Somalia kill six al Shabaab fighters","text":"The U.S. military said on Wednesday it had carried out air strikes in Somalia against an al Qaeda-allied Islamist group and killed six militants. The group, al Shabaab, is fighting to topple Somalia s Western-backed transitional federal government and impose its own rule on the Horn of Africa country. The U.S. military s Africa Command (AFRICOM) said in a statement it had carried out three air strikes on Wednesday at 2:15 a.m. local time (2315 GMT Tuesday).  The operation occurred in southern Somalia, about 260 kilometers (162 miles) south of the capital, Mogadishu,  the statement said.  Al Shabaab has lost control of most of Somalia s cities and towns since it was pushed out of Mogadishu in 2011. But it retains a strong presence in parts of the south and center and carries out gun and bomb attacks.","subject":"worldnews","date":"September 13, 2017 ","label":1},"truncated_cells":[]},{"row_idx":21,"row":{"Unnamed: 0":20770,"title":"SHAMEFUL! AIR FORCE VETERAN Ousted From Colleague’s Retirement Ceremony For Reading Dedication To U.S. Flag?! [VIDEO]","text":"OBAMA S AMERICA:  Why do you think people are leaving (the Air Force) in droves? What began as a dignified affair quickly turned into an embarrassing scene after a retired Air Force official was forcibly ejected from his colleague s retiree ceremony.The event was being held at Travis Air Force Base in California for Master Sergeant Chuck Roberson of the 749th Aircraft Maintenance Squadron.But the service was interrupted when Retired Senior Master Sgt. Oscar Rodriguez was forcibly ejected from the stage as he began to read out a statement honoring the American Flag to the audience.However, the recital was not a part of the usual procedure at retirement ceremonies and Rodriguez was told to stop.A video that captured the incident shows two men in camouflage uniform approach Rodriguez and say something quietly, but he appears not to respond.As the two men push him off stage, he continues to shout out the words, he is eventually pushed out of the room, but his shouts can still be heard in the distance.An investigation has since been launched into the disturbance, an Air Force Reserve official told Fox News Wednesday.An official said in a statement:  Rodriguez ignored numerous requests to respect the Air Force prescribed ceremony and unfortunately was forcibly removed. We will continue to investigate the situation fully. But John Huffington, who said he is a friend of the man whose retirement ceremony was taking place, posted the video on his Facebook with the comment:  This is disturbing at my friend s retirement today and the gentlemen that you are going to see in the video gets assaulted as a guest of my friend. He speaks the words of the color and strips [sic] as they fold the flag. The squadron commander and Oscar have issues from years ago the commander said he did not want him in the building nor saying the words to the flag. Remember he is my friend s guest. So instead of letting him finish what he started saying he had his trolls assault him dragging him out of the building as you can here [sic] him still saying the words to the flag. And you can here joe saying  do it do it. Theater is full of family and guests and fellow Air Force members. This could have been handled in a much better way instead of tainting my friend s retirement. This is how we treat our fellow Air Force veterans. Yes I m pissed off. And Stephen Sila, who identified himself as the officiating officer at the ceremony posted a long explainer on the Facebook page of John Q Public, an army blog where the story first appeared. Sila said that Rodriguez had been invited to speak at the ceremony and had planned to read a statement honoring the flag and that his appearance had been cleared through the proper avenues.But non squadron CC apparently had an issue with Rodriguez attending, apparently stemming from a personal issue at a previous squadron between the squadron CC and Mr Rodriguez, claimed Sila.He added:  Why do you think people are leaving (the Air Force) in droves? Because the guys in the trenches are subjected to nonstop stupidity from commanders who don t deserve the rank, respect, or support of the people they re in charge of. But the Air Force Reserve said in the statement it  respects and defends the right to free speech and religious expression.  Via: Daily Mail","subject":"left-news","date":"Apr 6, 2016","label":0},"truncated_cells":[]},{"row_idx":22,"row":{"Unnamed: 0":20860,"title":"Hashtag politics: Merkel tries to get in with Germany's kids","text":"After 12 years in power, Chancellor Angela Merkel is presenting  herself as more than just Germany s  Mutti , campaigning in cyberspace to get in with younger voters and win their support for long after elections this month. Merkel, whose nickname means  Mummy , appears to be cruising toward a fourth term with strong backing from older Germans. But the 63-year-old, who unlike some Western leaders has no personal Twitter account, wants to mobilize the almost 3 million first-time voters behind her conservative CDU party on Sept. 24. To this end, Merkel has fielded questions from four YouTube video bloggers, attended Europe s biggest computer games convention and set up a walk-in campaign center in Berlin s hip start-up district. Diana Kinnert, a 26-year-old who helped draft proposals to modernize the CDU, said parties should use new communication tools to make young people put off by  sterile  politics more politically engaged in the long term.  It would be a shame if it turned out to be just election noise,  Kinnert, who wears both tattoos and a baseball cap, told Reuters at the walk-in center. The CDU, which is unlikely to win an overall parliamentary majority, needs the youth vote to strengthen Merkel s hand in coalition negotiations that will follow polling day. To some bemusement, the party has created a Twitter hashtag #fedidwgugl. Rather than the result of a malfunctioning computer keyboard, it is an acronym for the CDU campaign slogan:  Fuer ein Deutschland In Dem Wir Gut und Gern Leben  ( For a Germany in which we can live well and gladly ). So the Berlin walk-in center, where themed rooms bring the CDU manifesto to life, is called  #fedidwgugl House .  In Britain, young people turned out in droves in June to vote for the opposition Labour party, stripping the ruling Conservatives of their majority and showing how youth can twist the fate of governments even if they are less numerous. With German society rapidly aging, older people still dominate the country s agenda. There are more than twice as many eligible voters aged over 60 as there are under 30. The CDU secured the highest share of the youth vote in 2013 but its support remains skewed toward pensioners. At the last election two-fifths of its backers were aged over 60 while just 5.4 percent were under 25. Kinnert, who has posted on Instagram wearing a T-shirt reading  Keep Calm and Vote for Angie , says Merkel never stops learning and is future-orientated despite her lengthy tenure. One of Merkel s top priorities is the digitization of German industry. She has Facebook and Instagram accounts and has made efforts to show she is up on social media even if it sometimes comes across as clunky. Asked about her favorite emoji during the YouTube interview, Merkel said it was a smiley:  If things are good, even one with a little heart,  she joked. Merkel s main challenger, Social Democrat leader Martin Schulz, has not shied away from cyberspace either. This week he was grilled on YouTube on topics such as legalizing cannabis, animal welfare and rolling out broadband internet. While the CDU was mocked for causing confusion with the #fedidwgugl hashtag, the media attention drew eyeballs to the CDU s agenda. Efforts to campaign over new media also play well with older voters who want the best for their children and grandchildren, said Stefan Marschall of Duesseldorf s Heinrich Heine University. Merkel is the only chancellor most first-time voters can recall. This helps CDU to portray her as an anchor of stability in the turbulent era of Donald Trump and Brexit. An opinion poll by Forsa in June found 57 percent of 18 to 21-year-olds backed Merkel compared with 53 percent of the wider population. Just 21 percent of the young supported Schulz. Forsa s managing director Manfred Guellner said younger Germans have become more conservative than their peers in other countries:  Young people here are pragmatic; they worry about their pensions.","subject":"worldnews","date":"September 6, 2017 ","label":1},"truncated_cells":[]},{"row_idx":23,"row":{"Unnamed: 0":5327,"title":"Progressive Champion Elizabeth Warren Will Deliver Keynote Speech To Democratic Convention","text":"The Democratic Party is poised to have a convention filled with powerhouse speakers that will dwarf the lineup of has-beens the GOP deployed.The Republican National Convention had unemployed actor Scott Baio and desperate Republicans who actually decided to show up. The Democratic Party will have New Jersey Senator Cory Booker, Vermont Senator Bernie Sanders and they will have Massachusetts Senator Elizabeth Warren in a spot that could very well set her up as Hillary Clinton s successor.Elizabeth Warren has successfully gotten under the thin skin of Donald Trump for months. Every time he attacks her on Twitter she responds by destroying him.In recognition of her efforts and her status as a defender of the poor and middle class in America against corporate exploitation, Warren has been chosen to deliver the keynote address at the DNC this week.Warren will be only the third woman to deliver the keynote speech. The first being Rep. Barbara Jordan in 1976, followed by beloved former Texas Governor and women s rights crusader Ann Richards in 1988. And while neither of those two women would go on to run for president, Elizabeth Warren stands on the cusp of history in the making. Hillary Clinton looks to become the first female president in American history. If she wins and serves with distinction, it could pave the way for Warren s rise as her successor in 2024 should she be willing to take on the mantle.As you may recall, a man named Barack Obama delivered the keynote address at the DNC Convention in 2004. Four years later he became the first African-American president in the United States.While the keynote address does not guarantee anyone of future presidential aspirations, it does mean a great deal to those who care about what the message of the party is. Warren is decidedly on the progressive wing of the Democratic Party, so she will more than likely focus on progressive issues such as raising the minimum wage, better healthcare, climate change, and working with our allies abroad while promoting tolerance and diversity. Clinton may not have chosen Warren as her running mate, but giving the keynote is a high honor and it gives Warren the opportunity to put progressive policies in the spotlight. This is especially important as Hillary continues to woo supporters of Bernie Sanders to her campaign.This keynote selection screams that Hillary Clinton is inching more to the left as progressives have been hoping and it gives progressives a bigger place at the table than they have had in many years. Combined with the platform changes Bernie Sanders was able to insert, this could signal a progressive agenda is on the way if Sanders  supporters are patient enough to let it happen gradually instead of all at once.The shift to the left could also mean that a more progressive candidate than Hillary Clinton could very well succeed her. That means progressivism has a bright future if they make sure a Democrat is elected to succeed President Obama in November. Because Donald Trump sure won t advance progressive policies.Featured image via Chris Somodevilla/Getty Images","subject":"News","date":"July 25, 2016","label":0},"truncated_cells":[]},{"row_idx":24,"row":{"Unnamed: 0":12539,"title":"Iran will treat jailed aid worker as Iranian citizen: foreign ministry","text":"Iran will treat a British-Iranian aid worker as an Iranian citizen and she will serve her sentence as determined by the judiciary, Iran s foreign ministry spokesman said on Monday. British Foreign Secretary Boris Johnson discussed Nazanin Zaghari-Ratcliffe s case with Iranian officials after flying to Tehran over the weekend to try to seek her release.  One of the issues that Johnson brought up in Tehran was the issue of Ms. Zaghari,  Iranian foreign ministry spokesman Bahram Qassemi was quoted by state media as saying.  With regard to her dual nationality, from our point of view of course she is Iranian and she has been sentenced by the judiciary and she will serve the period of her sentence.  Britain says Zaghari-Ratcliffe was visiting family on holiday in April 2016 when she was jailed by Iran for attempting to overthrow the government. Johnson said he urged the release of dual nationals.  I urged their release, on humanitarian grounds, where there is cause to do so,  Johnson told the British parliament.   These are complex cases involving individuals considered by Iran to be their own citizens, and I do not wish to raise false hopes. But my meetings in Tehran were worthwhile,  he said.  It is too early to be confident about the outcome.  Zaghari-Ratcliffe is not the only dual national being held in Iran, but her case has taken on political significance in Britain after Johnson said last month that she had been teaching journalists in Iran, which her employer denies. Johnson later apologized. Opponents have called for him to resign if his comments lead to her serving longer in prison. Qassemi said the Iranian foreign ministry would follow up on Zaghari-Ratcliffe s case but said that it was ultimately a matter for the judiciary. A project manager with the Thomson Reuters Foundation, Zaghari-Ratcliffe was sentenced to five years in prison after being convicted by an Iranian court of plotting to overthrow the clerical establishment. She denies the charges. The Thomson Reuters Foundation is a charity organization that is independent of Thomson Reuters and operates independently of Reuters News. It says Zaghari-Ratcliffe had been on holiday and had not been teaching journalism in Iran. Johnson also said he raised with Foreign Minister Mohammad Javad Zarif what he called  the official harassment of journalists working for BBC Persian and their families inside Iran.  The BBC has called on Iran to reverse a court order which it said effectively froze the non-liquid assets of 152 staff, former staff and contributors in Iran.","subject":"worldnews","date":"December 11, 2017 ","label":1},"truncated_cells":[]},{"row_idx":25,"row":{"Unnamed: 0":10731,"title":"Puerto Rico may issue delayed audited 2014 statements in April","text":"Puerto Rico’s much-delayed audited financial statements for 2014 are expected to be finished and issued by April, the U.S. territory’s governor said in a letter to U.S. House of Representatives Speaker Paul Ryan on Monday. The delay in completing the statements is due to the “complexities posed by our current financial crisis,” Governor Alejandro Garcia Padilla said in the letter, emailed by a representative for the commonwealth.  However, he added that there may be additional issues that arise that require an “adjustment to such timetable.” A draft of the financials, which cited “substantial doubt” about the government’s ability to continue as a going concern, was released last week, but did not include data from some agencies and has not been approved by auditors at KPMG.  The letter follows criticism from Republicans in Congress over the delay and a perceived lack of financial transparency from Puerto Rico. The island’s leaders are hoping for legislative help from Congress in tackling its $70 billion in debt, 45 percent poverty rate and dwindling population as locals flock to the mainland United States. Ryan has called on the Republican-led House to propose legislation by the end of March aimed at addressing Puerto Rico.  In Monday’s letter, Garcia Padilla gave a sense of what it might look like on the island if the government or its agencies failed to survive as going concerns — that is, became unable to meet financial obligations long term.  Entities subject to going concern assessments, Garcia Padilla wrote, include not only the government itself, but PREPA, the island’s sole power utility; HTA, which operates the island’s major roads; the Metropolitan Bus Authority, which transports thousands in the San Juan area; the Puerto Rico Medical Services Administration, the island’s main hospital and trauma center; and PRIHA, which oversees Medicaid benefits for 1.6 million poor residents.  Garcia Padilla also stressed that the Government Development Bank, Puerto Rico’s primary fiscal agent, may not be able to make debt payments in the last quarter of fiscal year 2016, and that the island may have to pass emergency legislation imposing a moratorium on GDB debt payments.","subject":"politicsNews","date":"February 22, 2016 ","label":1},"truncated_cells":[]},{"row_idx":26,"row":{"Unnamed: 0":23108,"title":"Aleppo Truth: Incredible Press Conference at the United Nations","text":"SEE MORE ALEPPO UPDATES & EXCLUSIVES HEREThis press conference is an excellent information tool for anyone who has serious questions about the true size and scope of the propaganda war being waged against Syria by governments and media organizations in the US, UK and EU member states. Please share with friends, family and colleagues On December 9, 2016, the permanent mission of the Syrian Arab Republic to the United Nations presented a panel of speakers who explained in detail what is really happening right now in Aleppo, Syria, and how the western media has intentionally distorted events in Syria over the last 5 years. Panels members include Dr. Bahman Azad, member of the coordinating committee for the Hands Off Syria and Organization Secretary of US Peace Council, and Eva Bartlett, independent Canadian journalist, Donna Nassor, professor and lawyer also part of US Peace Council, and Sara Flounders cofounder of the International Action Center. SUPPORT 21WIRE  SUBSCRIBE & BECOME A MEMBER @21WIRE.TV","subject":"Middle-east","date":"December 12, 2016","label":0},"truncated_cells":[]},{"row_idx":27,"row":{"Unnamed: 0":16911,"title":"Baghdad must show restraint, respect Kurdish rights, France says","text":"France on Friday called on Iraq s central government to show restraint after taking control of the last district in the oil-rich province of Kirkuk and said Baghdad should take the rights of Kurds fully into account.  Iraqi forces are seeking to reestablish Baghdad s authority over territory which the Kurdish forces occupied outside the official boundaries of their autonomous region, mostly seized since 2014 in the course of the war on Islamic State militants. [L8N1MV1K2]  We ask the federal government to show restraint and fully respect the rights of the Kurds,  foreign ministry spokeswoman Agnes Romatet-Espagne told reporters.  Tens of thousands of Kurds have fled Kirkuk and Tuz to the two main cities of the Kurdish autonomous region, Erbil and Sulaimaniya, according to Kurdish officials. The United Nations expressed concern on Thursday at reports of forced displacement and destruction of Kurdish homes and businesses, mainly in Tuz. Romatet-Espagne said the Kurds also needed to accept a dialogue with Baghdad within the framework of the constitution.","subject":"worldnews","date":"October 20, 2017 ","label":1},"truncated_cells":[]},{"row_idx":28,"row":{"Unnamed: 0":16473,"title":"JUDGE JEANINE IS FURIOUS! “Hillary Won’t Stop Lying!” [VIDEO]","text":"Can you blame her for losing her cool with Crooked Lying Hillary? Share this with all of your  undecided  friends!https://youtu.be/CCkXOix0g2Y","subject":"Government News","date":"Aug 7, 2016","label":0},"truncated_cells":[]},{"row_idx":29,"row":{"Unnamed: 0":7277,"title":"Short list of potential Trump administration picks","text":"U.S. President-elect Donald Trump recently announced the first major appointments to his administration but still has many positions to fill ahead of his inauguration on Jan. 20. Trump announced on Sunday he will hire Republican National Committee Chairman Reince Priebus as White House chief of staff and named Stephen Bannon, former head of the conservative web site Breitbart News, as his chief strategist and senior counselor. The selection of Bannon drew sharp criticism from Democrats, who criticized Breitbart News’ ties to racist messages. Below are people mentioned as contenders for senior roles. * Bob Corker, Tennessee senator and chairman of the Senate Foreign Relations Committee * John Bolton, former U.S. ambassador to the United Nations under President George W. Bush * Newt Gingrich, Republican former U.S. House Speaker * Zalmay Khalilzad, former U.S. ambassador to Iraq * Rudy Giuliani, Republican former mayor of New York City * Steven Mnuchin, former Goldman Sachs executive and Trump’s campaign finance chairman     * Jeb Hensarling, Texas Republican congressman and chairman of the House Financial Services Committee * Jamie Dimon, JPMorgan Chase & Co chief executive officer * Tom Barrack, founder and chairman of Colony Capital Inc * Lieutenant General Michael Flynn, former director of the Defense Intelligence Agency  * Stephen Hadley, former national security adviser under President George W. Bush * Jon Kyl, former Republican senator from Arizona * Jeff Sessions, Republican senator from Alabama and early Trump supporter, member of the Senate Armed Services Committee * Kelly Ayotte, outgoing Republican senator from New Hampshire and member of the Senate Armed Services Committee * Duncan Hunter, Republican congressman from California and early Trump supporter, member of House Armed Services Committee * Jim Talent, former Republican senator from Missouri who was on the Senate Armed Services Committee  * Rudy Giuliani * Jeff Sessions, senior member of the Senate Judiciary Committee who takes a hard line on immigration * Chris Christie, Republican New Jersey governor * Pam Bondi, Republican Florida Attorney General  * Trey Gowdy, Republican congressman from South Carolina who headed the House committee that investigated the 2012 attacks on the U.S. mission in Benghazi, Libya * Ben Carson, former neurosurgeon and 2016 Republican presidential candidate * Newt Gingrich * Rich Bagger, former pharmaceutical executive and former top aide to New Jersey Governor Chris Christie * Bobby Jindal, former Louisiana governor  * Michael McCaul, U.S. Republican congressman from Texas and chairman of the House Homeland Security Committee * David Clarke, Milwaukee county sheriff and vocal Trump supporter  * Joe Arpaio, outgoing Maricopa County, Arizona, sheriff who campaigned for Trump  * Myron Ebell, a climate change skeptic at the libertarian Competitive Enterprise Institute who is overseeing environmental policy on Trump’s transition team * Robert Grady, venture capitalist, partner in private equity firm Gryphon Investors  * Leslie Rutledge, Arkansas attorney general * Carol Comer, commissioner of the Indiana Department of Environmental Management * Harold Hamm, Oklahoma oil and gas mogul, CEO of Continental Resources Inc * Larry Nichols, co-founder of Devon Energy Corp * James Connaughton, CEO of Nautilus Data Technologies and a former environmental adviser to President George W. Bush * U.S. Representative Kevin Cramer, of North Dakota * Robert Grady * Sarah Palin, Republican former Alaska governor who ran for vice president in 2008 * Jan Brewer, former Arizona governor * Forrest Lucas, founder of oil products company Lucas Oil * Harold Hamm * Robert Grady * Linda McMahon, former world Wrestling Entertainment executive and two-time Senate candidate * Lieutenant General Michael Flynn * Mike Rogers, Republican former representative from Michigan who chaired the House Intelligence Committee * Pete Hoekstra, Republican former representative from Michigan * Lieutenant General Michael Flynn * Stephen Hadley * Kelly Ayotte * Richard Grenell, former spokesman for the United States at the United Nations  * Peter King, Republican representative from New York * Dan DiMicco, former chief executive of steel producer Nucor Corp * Jeff Miller, retiring congressman from Florida and chairman of the Veterans Affairs committee","subject":"politicsNews","date":"November 15, 2016 ","label":1},"truncated_cells":[]},{"row_idx":30,"row":{"Unnamed: 0":12525,"title":"May hails new optimism in Brexit talks after deal","text":"Prime Minister Theresa May hailed  a new sense of optimism  in Brexit talks, telling parliament on Monday an agreement to move negotiations on to future trade ties is progress and will reassure those concerned Britain may leave with no deal. May, weakened after losing her Conservatives  majority at a June election, rescued an agreement last week to move the talks to unravel more than 40 years of union on to a second phase after easing the concerns of her Northern Irish allies over the future role of the border with EU member Ireland. But the discussion of Britain s trade relationship with the EU after Brexit contains many pitfalls and could widen differences among her top team of ministers, or cabinet, over how Britain should look after it leaves the bloc.  In a statement to parliament, May took to task those who doubted that she could move the talks beyond the initial stage of agreeing terms on how much Britain should pay, citizens  rights and the border between the British province of Northern Ireland and EU member Ireland.       This is good news for people who voted leave who were worried we were so bogged down in the tortuous negotiations it was never going to happen,  she told parliament.  It is good news for people who voted remain who were worried were going to crash out without a deal.  May will head to Brussels on Thursday for a summit meeting at which she expects the leaders of the other 27 EU states to approve an assessment by negotiators that the sides have made  sufficient progress  to move on to phase two. But she warned that the government will only pay a financial settlement if Britain and the EU secure a future trade deal. The deal to launch further talks looked in jeopardy a week ago when May was forced to abandon a choreographed meeting in Brussels intended to seal the deal after her allies in Northern Ireland expressed fears she was proposing a special status for the region - out of sync with the rest of the United Kingdom. After days of diplomacy, there was a compromise - if no overall Brexit deal is secured, Britain will keep  full alignment  with those rules of the EU s single market that help cooperation between Ireland s north and south. But those words have reverberated in both London and Belfast, with Brexit minister David Davis saying they were more  a statement of intent  than a legally binding move. On Monday, Davis told LBC radio his words had been taken out of context and denied he was backing away from the commitment, which the EU described as  a deal between gentlemen .  And it is the clear understanding that it is fully backed and endorsed by the UK government,  the European Commission s chief spokesman Margaritis Schinas told reporters in Brussels. Davis  comments may have been aimed at members of the Northern Irish Democratic Unionist Party, which props up May s Conservative minority government in parliament after the party expressed concerns about how alignment could work without Britain staying in the EU s single market and customs union. Or he may have wanted to ease the fears of some campaigners for Britain to leave the EU, who say the possibility of having to follow the bloc s rules would mean that they would have Brexit in name only. But May said the commitments made in the first round of talks   which includes a payment of 35-39 billion pounds over many years to meet EU obligations   were necessary to sever ties with the bloc.  In doing so we can move on to building the bold new economic and security relationships that can underpin the new deep and special partnership we all want to see,  she said.  A partnership between the European Union and a sovereign United Kingdom that has taken control of its borders, money and laws once again.","subject":"worldnews","date":"December 11, 2017 ","label":1},"truncated_cells":[]},{"row_idx":31,"row":{"Unnamed: 0":436,"title":"Mother Of DACA Recipient Who Died Rescuing Flood Victims Refused Entry Into U.S. To Bury Her Son","text":"Donald Trump is set to end the Deferred Action for Childhood Arrivals program, also known as DACA, an Obama-era policy. It s a real d*ck move that is so appalling even Republicans are calling him out on it. Approximately 800,000 young people will be subject to immediate deportation, and that would have included Alonso Guillen, a 31-year-old disc jockey from Lufkin, Texas who gave his life while trying to rescue others in the state in the wake of Hurricane Harvey.On Wednesday, Guillen disappeared along with two of his friends after their boat hit the bridge over the creek and capsized, the Houston Chronicle reports.One of his friends clung to a tree and was eventually rescued but days later, Guillen and Tomas Carreon Jr. were still missing. Carreon s body was found floating down the creek on Friday.On Sunday, Guillen s body was found as it floated past a sandy berm. A relative quickly dove in and pulled his body to the shoulder of the creek. Soon after, a boat took him to shore.The Houston Chronicle reports:Guillen s father, Jesus Guillen, said he d asked his son not to try and rescue people in the storm, but he insisted, saying he wanted to help people. He cried and prayed on Sunday afternoon as they pulled his son s body from the water. Thank you, God,  he said,  for the time I had with him. Trump would have had Mr. Guillen deported and now Border agents are refusing to let his mother into the U.S. in order to bury her son.Guillen was a recipient of the DACA program and his father is here legally but his mother, Rita Ruiz de Guillen, 62, is still in the application process for legal status.Mrs. Guillen said from her home in Rita Ruiz, Mexico, across the border from Eagle Pass, that she s asking God for strength. I ve lost a great son, you have no idea,  she said while weeping softly on the other end of the phone.  I m asking God to give me strength. She explained that she had hoped that U.S. Customs and Border Protection officials would take pity and grant her a humanitarian visa so that she could go to Houston and bury her son, but she was turned back at the border. When we are with God, there are no borders,  she said.  Man made borders on this earth. To a man like Donald Trump, Alonso Guillen is one  bad hombre.  To anyone with a heart, he died a hero.Featured image via Christopher Furlong/Getty Images","subject":"News","date":"September 4, 2017","label":0},"truncated_cells":[]},{"row_idx":32,"row":{"Unnamed: 0":4331,"title":"Watch Lindsey Graham Accept Defeat Over Trump: ‘I Can’t Go Where He’s Taking The Country’ (VIDEO)","text":"Lindsey Graham has been one of the biggest Republican voices against GOP nominee Donald Trump, and he only grew louder as Trump gained more support. The South Carolina senator has had a hard time of it, too   he has called on Trump to apologize for several offensive things he s said, then he supported Trump briefly before aggressively crusading to get the Republican party to un-endorse Trump, and then he revealed that he himself would not be endorsing the humiliating candidate.Graham has been a nervous wreck over having to watch Trump destroy his beloved GOP right before his very eyes. But earlier today, Graham seemed to have finally accepted defeat and the fact that the Republican party he has known and loved will never be the same again. In an interview with At This Hour s Kate Bolduan and John Berman on CNN, Graham sorrowfully said: I ve come to the point now where I can t go where he is taking the party or the country. Graham also expressed that he was worried about what Trump s intentions were for America, but showed a brilliant amount of ignorance as he expressed he was open to the idea that Trump might grow as a politician (not happening). And to prove what a mess Trump s campaign really is, Graham brought up a talking point of Trump s, only be told by the hosts that it was actually an idea that came from Mike Pence, Trump s VP pick.You can watch Graham accept his circumstances below, and you can tell that it s absolutely killing him.Sen. Lindsey Graham on Trump:  I can t go where he is taking the party  https://t.co/6OZtrfIwim https://t.co/FgCRZeO6Er  CNN Politics (@CNNPolitics) October 6, 2016 Graham seems absolutely destroyed by a GOP under Trump, but we all know that conservatives have created this nightmare for themselves. They created a hateful, bigotry-filled political climate that allowed someone like Trump to excel, and they failed to stop him.Featured image via Scott Olson / Getty Images","subject":"News","date":"October 6, 2016","label":0},"truncated_cells":[]},{"row_idx":33,"row":{"Unnamed: 0":2559,"title":"Senate committee issues subpoena for Manafort: statement","text":"A U.S. Senate panel has issued a subpoena to force Paul Manafort, a former campaign manager to President Donald Trump, to appear at a hearing on Wednesday as part of its probe into Russia’s role in the 2016 presidential election. The Republican chairman of the Senate Judiciary Committee, Charles Grassley, and the top Democrat on the panel, Dianne Feinstein, said the subpoena was issued late on Monday after Manafort did not agree to an interview. “While we were willing to accommodate Mr. Manafort’s request to cooperate with the committee’s investigation without appearing at Wednesday’s hearing, we were unable to reach an agreement for a voluntary transcribed interview with the Judiciary Committee,” they said in a statement on Tuesday. They said Manafort was willing to provide only a single transcribed interview to Congress, which would be available to the Judiciary Committee as well as other panels. “As with other witnesses, we may be willing to excuse him from Wednesday’s hearing if he would be willing to agree to production of documents and a transcribed interview,” they said. The panel leaders also said any Manafort interview would not constitute a waiver of his rights and the committee could require that he testify in the future. Earlier, NBC News reported Manafort would speak with Senate investigators within 48 hours, citing a source close to Manafort.  It said he was likely to be questioned about a June 2016 meeting in New York with a Russian lawyer. Trump’s eldest son, Donald Trump Jr, has released emails that showed he welcomed the prospect of receiving damaging information at the meeting about Democratic rival Hillary Clinton. The Senate panel is one of several congressional committees investigating alleged Russian efforts to tilt the election in the Republican candidate’s favor and possible collusion by Trump’s campaign. Moscow has denied such efforts, and Trump has denied his campaign colluded.","subject":"politicsNews","date":"July 25, 2017 ","label":1},"truncated_cells":[]},{"row_idx":34,"row":{"Unnamed: 0":3446,"title":"China Fires Back As Trump Drama ESCALATES Before He Even Takes Office","text":"President-elect Donald Trump has yet to take office, yet he s still causing international issues for America. Just last week, on December second, Trump had a 10-minute conversation with Tsai Ing-wen, the president of Taiwan. This was the first time a US President or president-elect had a direct conversation with Taiwan officials since 1979.In 1979 Taiwan was diplomatically recognized as China as part of the  One China  policy. Since then there has been no direct contact between Taiwanese and US leaders. Well, Trump ruined that. He claimed in a tweet that Tsai Ing-wen called him, but it s debated whether or not the phone call had been arranged by Trump s  Taiwan friendly  staff.The President of Taiwan CALLED ME today to wish me congratulations on winning the Presidency. Thank you!  Donald J. Trump (@realDonaldTrump) December 3, 2016Donald said it was a mere congratulatory call, but the transition team said otherwise:  President-elect trump spoke with President Tsai Ing-wen, who offered her congratulations,  they wrote.  During the discussion, they noted the close economic, political, and security ties exist between Taiwan and the United States. President-elect Trump also congratulated President Tsai on becoming President of Taiwan earlier this year.  His team also claimed the call was planned months in advance. After receiving some criticism for the phone call Trump responded in a Tweet once again:Interesting how the U.S. sells Taiwan billions of dollars of military equipment but I should not accept a congratulatory call.  Donald J. Trump (@realDonaldTrump) December 3, 2016In response to Trump s actions, China flew an H-6, an airplane capable of carrying nuclear bombs along the  nine-dash line . US officials reported to Fox News that this was to send a message to the new administration. With this phone call we can be sure that Trump has put some doubt in the minds of Chinese officials about his intentions.Featured image via Getty Images","subject":"News","date":"December 12, 2016","label":0},"truncated_cells":[]},{"row_idx":35,"row":{"Unnamed: 0":6944,"title":"Trump is 'well aware' of what U.S. policy has been on Taiwan: spokeswoman","text":"Donald Trump is “well aware” of what U.S. policy has been on Taiwan, Trump’s spokeswoman said, after the U.S. president-elect spoke by phone on Friday with Taiwan’s president, a move likely to infuriate China.  “President-elect Trump is fully briefed and fully knowledgeable about these issues on an ongoing basis, regardless on who is on the other end of the phone,” Trump spokeswoman Kellyanne Conway told CNN.","subject":"politicsNews","date":"December 3, 2016 ","label":1},"truncated_cells":[]},{"row_idx":36,"row":{"Unnamed: 0":9640,"title":"Alabama's top judge faces ethics charges over gay-marriage order","text":"Alabama’s Supreme Court Chief Justice was suspended on Friday  for ordering state probate judges not to grant marriage licenses to gay couples, despite contrary rulings by a federal court and the U.S. Supreme Court. Chief Justice Roy Moore, an outspoken opponent of same-sex unions, faces possible removal from the bench after the Alabama Judicial Inquiry Commission charged him with violating the state’s judicial ethics laws, according to news website AL.com.  The legality of gay marriage had been at the center of a national debate until the Supreme Court ruled in June that the U.S. Constitution provides same-sex couples the right to marry, handing a historic triumph to the American gay rights movement.   Despite the decision and a federal court ruling that made gay marriage legal in Alabama, Moore in January issued an administrative order to state probate judges that they should not issue marriage licenses to same-sex couples, according to court documents.  “Chief Justice Moore flagrantly disregarded and abused his authority,” the complaint said. “Moore knowingly ordered (probate judges) to commit violations ... knowingly subjecting them to potential prosecution and removal from office.” Moore said in a statement that the commission had no authority over administrative orders or the court’s ability to prohibit probate judges from issuing same-sex marriage licenses.   “We intend to fight this agenda vigorously and expect to prevail,” he said.   Moore wrote in his order that the U.S. Supreme Court ruling was at odds with a decision in March 2015 by the Alabama Supreme Court that instructed probate judges to stop issuing marriage licenses to same-sex couples. The conflicting opinions had resulted in “confusion and uncertainty,” Moore said, with many probate judges issuing marriage licenses to gay couples while others refused to do so. [uL1N14R283] The Human Rights Campaign, the biggest U.S. gay rights organization, hailed the suspension. “Roy Moore is an embarrassment to the state of Alabama,” Eva Walton Kendrick, the group’s Alabama state manager, said in a statement. Moore, a Republican, has been a hero of conservative causes before. In 2003, he was removed from office after a federal judge ruled he was placing himself above the law by refusing to take down a Ten Commandments monument. He won the chief justice job back in 2012, vowing not to do anything to create further friction with the federal courts.","subject":"politicsNews","date":"May 7, 2016 ","label":1},"truncated_cells":[]},{"row_idx":37,"row":{"Unnamed: 0":8326,"title":"U.S. Senator McCain wins Arizona Republican nominating contest","text":"Senator John McCain survived a Tea Party challenge when he won Arizona’s Republican nominating contest on Tuesday, enabling him to seek a sixth term as U.S. senator from the southwestern state, according to media projections. McCain, 80, defeated former Arizona state Senator Kelli Ward and is slated to defend his Senate seat against Democratic  Representative Ann Kirkpatrick in the Nov. 8 election.","subject":"politicsNews","date":"August 31, 2016 ","label":1},"truncated_cells":[]},{"row_idx":38,"row":{"Unnamed: 0":10290,"title":"Sergeant Bergdahl says 'fantastic' plan crumbled hours after leaving post","text":"U.S. Army Sergeant Bowe Bergdahl had devised what he told a military investigator was a “fantastic plan” to leave his post so he could inform higher-ups about problems in the ranks, but that fell apart when he realized he took on more than he could manage. Bergdahl, 29, who walked away from his post in Afghanistan in 2009 and became a Taliban prisoner for five years, is facing a court-martial with a potential life sentence on charges of desertion and endangerment of U.S. troops. In a 371-page interview made public on Wednesday, Bergdahl said he was frustrated and concerned about the command at his post in Afghanistan, seeing it as incompetent, immoral and putting soldiers’ lives in danger. He devised a scheme to leave and travel by foot to a military command about 20 miles away, with his disappearance causing a full-scale search. When he arrived, he thought this would get him an audience with a general to air his grievances. “I came up with a fantastic plan,” he told the military investigator in 2014 about three months after his release. “I was seeing things heading in a very dangerous direction. So, I had to do something.”  He left at night and was captured the next day by the Taliban.   “By daylight, I will admit I was in over my head,” he said in the transcript released by Bergdahl’s lawyer Eugene Fidell, of an interview with Army investigator, Major General Kenneth Dahl, in 2014. At the end of the interview, Dahl mentioned desertion, AWOL and fraudulent enlistment offenses to Bergdahl but made no mention of the more serious charge of endangering U.S. troops, which carries up to a life sentence, according to the transcript.  At an evidentiary hearing in Texas in September 2015, Dahl said he did not believe Bergdahl should be jailed for what he did. He said Bergdahl was not a Taliban sympathizer and characterized him as an unrealistically idealistic soldier.  Dahl also said no soldiers directly involved in the search for him were killed. U.S. military prosecutors have said Bergdahl sneaked off his  post, resulting in a 45-day search that put soldiers’ lives at risk and diverted attention from the fight against the Taliban. Bergdahl was freed in a prisoner swap in May 2014 involving the release of five Taliban leaders held by the United States. The deal drew heavy criticism from Republicans.","subject":"politicsNews","date":"March 17, 2016 ","label":1},"truncated_cells":[]},{"row_idx":39,"row":{"Unnamed: 0":6912,"title":"Bill Nye CRUSHES The A-Hole Who Started The Rumor That He Would Debate Sarah Palin (VIDEO)","text":"The internet went giddy with anticipation earlier this week when a story came out of Variety Magazine claiming that Bill Nye had been invited to debate Sarah Palin on the subject of climate change after the debut of the climate-denier propaganda film Climate Hustle in early May. Before Variety could update their article after being contacted by a Nye spokesperson with the truth, media outlets across the web had picked up and reported on the story.Before long it was trending all over social media. Even with the story being updated with the information that Nye would only appear in pre-recorded clips, the excitement of Palin going down in flames in what would have been the butt-kicking of the century continued to spread far and wide. Unfortunately, it isn t going to happen. The clips of Nye will most likely be heavily edited to make it look like he s hiding something as if there s some kind of profit to be made on the  hoax  that the earth is getting warmer.According to Nye, the man behind the movie and the panel of  experts,  Marc Morano, is the guy who started the rumor in the first place. Morano apparently used the idea of a debate between The Science Guy and the Queen of the Ditzes to promote his film. Nye says he was never invited to any such panel to debate anything: Marc Morano did not invite me to his movie but he said I refused to come after he did invite me   he was making that up. It s disingenuous, at best. The video is yet another beautiful and punishing blow by Bill Nye to yet another anti-science buffoon. There s been no response from Morano, but rumor has it he s in Kentucky drinking biblical mead and licking his wounds with Ken Hamm. Enjoy the video below, courtesy of Bill Nye s Facebook Page:https://www.facebook.com/billnye/videos/vb.48947135361/10154211049280362/?type=2&theaterFeatured image by Frederick Brown/ Getty Images","subject":"News","date":"April 14, 2016","label":0},"truncated_cells":[]},{"row_idx":40,"row":{"Unnamed: 0":14176,"title":"WHOA! JOHN KASICH Makes A Crazy Prediction About The GOP Convention You Just Won’t Believe","text":"Could the people behind this delusional candidate just give him the low down that he s got NO chance at the Republican nomination unless he steals it in that case he s even crazier and more passive aggressive than we thought. John Kasich is saying it s going to be  cool  and the he thinks he s going to be the nominee: It s going to be so much fun. Kids will spend less time focusing on Bieber and Kardashian and more time focusing on how we elect presidents. It will be so cool. Republican presidential candidate John Kasich said he thinks he has a good chance at a contested convention this summer. I believe that a convention will look at somebody like me, and that s why I think I m going to be the nominee,  the Ohio governor said on ABC s  This Week  on Sunday.Kasich said he expects to continue gaining momentum and picking up delegates until the convention. Kasich then touted his poll numbers in head-to-head match-ups against Democratic front-runner Hillary Clinton, saying he beats Clinton in  virtually every poll. I m the only one that does it on the Republican side,  he said.He also talked about his record on job growth, adding he has international foreign policy knowledge and the experience to be a competitive candidate. We just have to keep going, and we re going to have an open convention,  Kasich said. It s going to be so much fun. Kids will spend less time focusing on Bieber and Kardashian and more time focusing on how we elect presidents. It will be so cool. Read more: The Hill","subject":"politics","date":"Apr 3, 2016","label":0},"truncated_cells":[]},{"row_idx":41,"row":{"Unnamed: 0":4159,"title":"T-shirts Were Sold Outside Bills Game With Rifle Sight On Kaepernick (IMAGES)","text":"San Francisco 49ers quarterback Colin Kaepernick again took to his knee during the national anthem in Sunday s game against the Buffalo Bills, but before that, a loud chant of  USA, USA  could be heard at the stadium from those offended by his right to silently protest against racial inequality.The chants weren t even the worst thing on display. Just outside of the stadium, t-shirts were being sold with an image of Kaepernick with a rifle sight on him. The text on the t-shirt reads,  Wanted  and  Notorious Disgrace to America. Another t-shirt reads,  Shut Up And Stand Up!  along with the quarterback s last name spelled  Kaeperdick  and an image of him.Robert Klempko of MMQB tweeted,  Shirts with a rifle scope trained on Colin Kaepernick selling for $10 outside of Ralph Wilson stadium.  It gets even worse:Elsewhere outside the stadium, one group of fans were hitting a dummy wearing a Kaepernick jersey and an afro wig. Per Klemko, one fan, yelled,  Tackle the Muslim. That ugly display was captured on video and so was this incident:Here's a very drunk Bills fan spearing a dummy with Kaepernick jersey and afro wig. pic.twitter.com/PDo0NL2Pcp  Robert Klemko (@RobertKlemko) October 16, 2016Klempko wrote in a following tweet,  FWIW: Guy walking past this scene cupped his hands around his mouth and yelled,  THIS JUST MAKES BUFFALO LOOK BAD! FWIW: Guy walking past this scene cupped his hands around his mouth and yelled, \"THIS JUST MAKES BUFFALO LOOK BAD!\"  Robert Klemko (@RobertKlemko) October 16, 2016While conservatives consider Kaepernick s continued protest over racial inequality and oppression in the United States to be unpatriotic, they probably also think descending on Washington D.C. with t-shirts describing America s first black president as a scary black Kenyan is patriotic. I don t understand what s un-American about fighting for liberty and justice for everybody, for the equality this country says it stands for,  Kaepernick said after the game.  To me, I see it as very patriotic and American to uphold the United States to the standards that it says it lives by. But Kaepernick was not alone. Outside the stadium, African-Americans and whites knelt in solidarity with the quarterback s cause.#Bills fans, black and white, kneel during the anthem outside the stadium before the #49ers game. pic.twitter.com/kCmsIs94GM  Nick Veronica (@NickVeronica) October 16, 2016On a good note, Kaepernick said death threats are  rare occurrences now.  On a bad note, he never should have received death threats in the first place.Photo by Thearon W. Henderson via Getty.","subject":"News","date":"October 17, 2016","label":0},"truncated_cells":[]},{"row_idx":42,"row":{"Unnamed: 0":15094,"title":"China faces historic corruption battle, ruling party's new graft buster says","text":"China must win its battle against corruption or face being erased by history, its new top graft buster said in an editorial on Saturday, underscoring the ruling Communist Party s focus on eliminating corrupt behaviour. Zhao Leji, appointed to the new seven-member Politburo Standing Committee last month and tasked to lead President Xi Jinping s signature war on corruption, wrote in the state-run People s Daily that failure would lead to the party s downfall.  If our control of the party is not strong and party governance is not strict, then the party won t be able to avoid being erased by history and the historic task the party carries will not be able to be fulfilled,  Zhao wrote. Xi, like others before him, has warned that corruption is so serious it could lead to the end of the party s grip on power. Xi s corruption fight has ensnared more than 1.3 million officials. At last month s five-yearly party congress he said it would continue to target both  tigers  and  flies , a reference to elite officials and ordinary bureaucrats. Zhao, formerly a low-profile official, replaced Wang Qishan, whose sweeping anti-graft campaign had made him China s second most-powerful politician.  The facts tell us and warn us that the party s position as the top political leader and power is the foundation of our political stability, economic development, national unity and social stability,  Zhao wrote. Zhao leads the Central Commission for Discipline Inspection (CCDI), having previously been in charge of the party s powerful organisation department, which is in charge of personnel decisions. He added that there would be no tolerance of people who  just do what they want to do  and ignore orders or carry on with banned behaviours like trying to get around policy decisions. Promotions also needed to be rigorously scrutinised, he said, a reference to numerous previous scandals where corrupt officials had abused their power or taken bribes to promote friends and family members.  Officials  personal files must be examined, and individuals  reports on their personal matters must be verified,  Zhao wrote. Above all, the leadership of the Communist Party had to be maintained, as the last 100 years of history had shown that without the party s leadership  there is no way out , he added. China has plans for a national supervision law and a new commission next year to oversee the expansion of Xi s graft fight.","subject":"worldnews","date":"November 11, 2017 ","label":1},"truncated_cells":[]},{"row_idx":43,"row":{"Unnamed: 0":5522,"title":"White House defends Trump criticism of Nordstrom for dropping Ivanka clothing line","text":"The White House defended President Donald Trump’s criticism of the Nordstrom retail chain on Wednesday, saying the firm’s decision to drop his daughter Ivanka’s clothing line for the coming season was politically motivated attack. “I think this was less about his family’s business than an attack on his daughter,” White House spokesman Sean Spicer told a news briefing. Although Nordstrom has said the decision not to carry Ivanka Trump’s line was based on its performance, Spicer said there had been “a direct attack on his policies and her name” and Trump was standing up for her because she was “being maligned because they have a problem with his policies.”","subject":"politicsNews","date":"February 8, 2017 ","label":1},"truncated_cells":[]},{"row_idx":44,"row":{"Unnamed: 0":4409,"title":"Hillary Clinton Mocks Donald Trump With An AMAZING Tweetstorm At 3 AM","text":"This is hilariously perfect.Hillary Clinton has already responded to Republican nominee Donald Trump s 3am temper tantrum on Twitter but decided to double down early Saturday morning by mocking him with a 3am Twitter barrage of her very own. Except whereas Trump focused on hurling sexist insults, Hillary focused on touting public service and threw in some characteristic Trump-speak.It s 3:20am. As good a time as any to tweet about national service. https://t.co/6hRCC16UiV  Hillary Clinton (@HillaryClinton) October 1, 2016There are hundreds of thousands more @AmeriCorps applications than spots. Horrible! Let s expand it from 75,000 annual members to 250,000.  Hillary Clinton (@HillaryClinton) October 1, 2016Too many talented young people pass up on programs like @Peacecorps because of student loans. Let s use GOOD JUDGMENT & lighten that burden.  Hillary Clinton (@HillaryClinton) October 1, 2016Remember, don t believe the haters who describe America as hopeless and broken. We should lift each other up, not tear each other down.  Hillary Clinton (@HillaryClinton) October 1, 2016For those few people knocking public service, hope you ll reconsider answering the call to help others. Because we re stronger together.  Hillary Clinton (@HillaryClinton) October 1, 2016Prior to Hillary s tweets, Massachusetts Senator Elizabeth Warren absolutely humiliated Trump on her Twitter feed as well.Warren pointed out that Trump never tweets about truly important things at 3am such as helping students and workers. Then she landed this knock-out punch.A thin-skinned bully who thinks humiliating women at 3am qualifies him to be President does not understand America & is not fit to lead.  Elizabeth Warren (@elizabethforma) September 30, 2016While Trump acts like a petulant child, Hillary Clinton is demonstrating that she is the adult in the 2016 race.Trump s Twitter tantrum early Friday morning was disgraceful and proved that he does not have the temperament necessary to be President of the United States.Hillary Clinton, on the other hand, is the only candidate in this race who has the experience, dedication to public service, and, yes, the perfect temperament to be an effective commander-in-chief. This is how a presidential candidate is supposed to act.Featured image: Justin Sullivan/Getty Images","subject":"News","date":"October 1, 2016","label":0},"truncated_cells":[]},{"row_idx":45,"row":{"Unnamed: 0":12068,"title":"WATCH STANDING OVATION For The Trump Family As They Arrive for Christmas Eve Service [VIDEO]","text":"https://www.youtube.com/watch?v=JzM9awNaewMThe Trump family has frequented the church many times in the past few decades. Trump married his third and current wife, Melania, there in 2005. The following year, Trump s youngest son, Barron, was christened there. And Trump attended the Christmas Eve service at Bethesda-by-the-Sea last year, and the Easter service earlier this year.Fun fact: Michael Jordan was married at the church in 2013.","subject":"politics","date":"Dec 25, 2016","label":0},"truncated_cells":[]},{"row_idx":46,"row":{"Unnamed: 0":11158,"title":"COLLEGE SNOWFLAKES FREAK OUT! “Feel Unsafe” Over VP Pence’s Planned Commencement Speech [Video]","text":"Notre Dame students are freaking out over Vice President Pence s planned commencement speech. Once again, the college snowflakes are trying to shut down free speech. How will these students ever survive in the real world?The college is breaking with a 60-year tradition by not inviting the sitting president to speak. Instead, the University President announced Pence s scheduled visit noting he s a  native son : It is fitting that in the 175th year of our founding on Indiana soil that Notre Dame recognize a native son who served our state and now the nation with quiet earnestness, moral conviction and a dedication to the common good characteristic of true statesmen,  said Notre Dame President Rev. John I. Jenkins, C.S.C.  With his own brand of reserved dignity, Mike Pence instilled confidence on the state level then, and on the world stage now. We are proud to welcome him to represent the new administration. Notre Dame students protesting VP Pence as this year s commencement speaker because it makes them  feel unsafe  pic.twitter.com/W7mJoFp6dV  FOX & friends (@foxandfriends) April 12, 2017 University of Notre Dame students have begun a  #NotMyCommencementSpeaker  white board campaign to protest the invitation of Vice President Mike Pence to speak at Commencement.Last week, seniors Immane Mondane and Jourdyhn Williams invited students to take photos holding white boards with  direct quotes from Pence that are racist, sexist, homophobic, xenophobic, offensive, or ostracizing to members of our community,  along with the hashtag  #NotMyCommencementSpeaker. Alternatively, students could also write about why they  feel unsafe with the presence of Mike Pence on our campus,  with daily opportunities to have photos taken with their whiteboards through the week.Once all the photos have been compiled, the organizers plan to share them on social media in hopes of starting a  discussion  about Pence s invitation. For me personally, Pence represents the larger Trump administration,  Mondane told The Observer.  His administration represents something, and for many people on our campus, it makes them feel unsafe to have someone who openly is offensive but also demeaning of their humanity and of their life and of their identity. While the photos do not appear to have been posted yet, Mondane provided The Observer with several examples of the complaints that students shared.One student used a quote from Pence favoring traditional marriage, writing on their board,  Congress should oppose any effort to put gay and lesbian relationships on an equal status with heterosexual marriage  -Pence #NotMyCommencementSpeaker. Another read,  Because I am the daughter of Immigrants Family  of LGBTQ folks. Read more: Campus Reform","subject":"politics","date":"Apr 12, 2017","label":0},"truncated_cells":[]},{"row_idx":47,"row":{"Unnamed: 0":7212,"title":"U.S. spy chief declines to comment on whether Russia shared info with Americans from hacks","text":"The U.S. Director of National Intelligence declined to comment on Thursday when asked whether Russia or those responsible for hacking the Democratic Party or Democratic party organizations had shared any information with the United States or Americans over the last year and a half.  “Sir, I’d rather not respond off the top of my head and in any event this would probably best left to a classified session,” James Clapper told a House intelligence committee hearing.","subject":"politicsNews","date":"November 17, 2016 ","label":1},"truncated_cells":[]},{"row_idx":48,"row":{"Unnamed: 0":21195,"title":"China probes former vice-chief of securities regulator for graft","text":"A former vice-chairman of China s securities regulator, Yao Gang, is being investigated for taking bribes, the official China Daily said, citing the prosecutors  office. Yao was one of the most senior figures arrested in a  crackdown on suspected stock manipulation in late 2015, after the mid-year collapse of the Chinese stock market following a long bull run. Yao was subject to  coercive measures,  which can range from summons and surveillance to detention and arrest, among other actions, the Supreme People s Procuratorate said, without specifying which he faced, the newspaper said on Thursday. In July, China s graft watchdog said Yao would be prosecuted for offences that included taking bribes and  destroying the order of capital markets . Yao, 55, was the general manager of Guotai Junan Securities in 1999 before taking a position with the China Securities Regulatory Commission in 2002, the paper said. At the CSRC, he was known as the  King of IPOs , overseeing initial public offerings on the Chinese mainland for 13 years, it added.","subject":"worldnews","date":"September 1, 2017 ","label":1},"truncated_cells":[]},{"row_idx":49,"row":{"Unnamed: 0":3938,"title":"FBI's Comey on Trump travel ban: 'citizenship alone' not threat indicator","text":"FBI Director James Comey concurred with a Democratic lawmaker on Wednesday that citizenship alone is not a reliable indicator of the “terror threat” a person may pose to the United States, a rebuke of President Donald Trump’s executive order banning travel from several Muslim-majority countries.  “Most of the people that I talked about that we have open cases on are American citizens,” Comey told a U.S. Senate panel, agreeing with  Senator Patrick Leahy that citizenship does not determine a person’s intentions. Trump’s restrictions on visa issuance to citizens of Syria, Iran, Libya, Yemen, Sudan and Somalia is on hold by federal court order.","subject":"politicsNews","date":"May 3, 2017 ","label":1},"truncated_cells":[]},{"row_idx":50,"row":{"Unnamed: 0":8626,"title":"Donna Brazile DESTROYS Palin For Blaming Her Woman-Beating Son’s Arrest On Obama (VIDEO)","text":"Sarah Palin did something entirely expected of her, yet so irrationally stupid that it is almost baffling following the arrest of her son for drunkenly beating his girlfriend and making threats with a semiautomatic weapon: She found a way to blame President Obama.At a Trump rally, where nonsensical bullshit is accepted as fact without question by the vapid, racist buffoons that make up the billionaire s base, Palin said that PTSD and Obama were the true culprits in her son s woman-brutalizing, ammosexual ways: I can talk personally about this, I guess it s kind of the elephant in the room. My son like so many others, they come back a bit different, they come back hardened, they come back wondering if there is that respect for what it is that their fellow soldiers and airmen and every other member of the military so sacrificially have given to this country. And that starts from the top. It s a shame that our military personnel even have to wonder, if they have to question, if they re respected anymore. It starts from the top. The question though that comes from our own president where they have to look at him and wonder, do you know what we go through? Do you know what we re trying to do to secure America and to secure the freedoms that have been bequeathed us? I can certainly relate with other families who kind of feel these ramifications of some PTSD and some of the woundedness that our soldiers do return with,  Palin said.  And it makes me realize more than ever it is now or never for the sake of Americas finest that we have that commander in chief that will respect them and honor them. Track Palin served with the Alaska-based 25th Infantry Division s 1st Stryker Brigade Combat Team for a single year in 2008, while George W. Bush was still President.Palin s nonsensical claim didn t sit well with veterans   or with CNN political commentator Donna Brazile, who put Palin on blast Wednesday. You have known me for a long time, so I m just gonna say it: she s a liar,  Brazile told Anderson Cooper.  That s a damn lie.  She pointed out that House Republicans slashed $1.4 billion (with a  b ) from President Obama s requested budget for veterans  services, which included a $690 million reduction  for medical care   the sort of thing that would help veterans with PTSD: I care for all veterans   I am the daughter of a veteran. And to go out there and to insinuate that the president of the United States is trying to hurt veterans when in fact he is trying to put more resources so that we can give our young and old veterans the care we need, that s just a damn lie. You can say Donna Brazile said it. I approve this message. Of course [Track Palin] should be held responsible for his own personal behavior,  Trump supporter Jeffrey Lord contended when asked if Palin was right to blame Obama.  But we have been told time and time and time again that there is a serious problem within the VA treating veterans. And I think that s the point she s trying to make.  He did not explain how in the world blaming Obama brought attention to any issues with the VA. Drink the water, Jeff,  Brazile shot back.  Drink the water. Watch Brazile smack Caribou Barbie down below:[youtube https://www.youtube.com/watch?v=ctVqhpQXQeI&w=640&h=360]Featured image via Wikimedia Commons","subject":"News","date":"January 21, 2016","label":0},"truncated_cells":[]},{"row_idx":51,"row":{"Unnamed: 0":6747,"title":"Senate Republican leader backs investigation into Russian hacking","text":"The Senate’s top Republican broke with President-elect Donald Trump on Monday over whether Russian hacking during the U.S. election merited closer scrutiny, a fissure between Trump and his party that appeared to grow as lawmakers pressed for a special investigation into the matter. The divide raised the possibility of enduring clashes between Trump and Republicans during his presidency over how to handle Russian President Vladimir Putin, a leader long viewed by many in the party as a calculating, untrustworthy foe but whom Trump has repeatedly praised for his leadership. “The Russians are not our friends,” Senate Majority Leader Mitch McConnell told a news conference. Calls on Sunday by two leading Republican foreign policy voices, Senators John McCain and Lindsey Graham, to investigate Russia’s hacking were buoyed on Monday by McConnell, who said Russia’s involvement needed further investigation. “Any foreign breach of our cyber security measures is disturbing, and I strongly condemn any such efforts,” McConnell said. “This simply cannot be a partisan issue.” McConnell said it “defies belief” that Republicans would be reluctant to investigate Russian actions. McConnell’s remarks contrasted with those of Trump and his staff, who scoffed at reports that the CIA had concluded the hacks and leaks of Democratic emails were carried out with the goal of helping Trump defeat Democrat Hillary Clinton. Trump said the conclusion was “ridiculous.” Some lawmakers have called for a special committee to investigate the hacking, but McConnell did not back that idea, saying he has confidence in the Senate Intelligence and Armed Services committees. Cory Gardner, a Republican, said the Russian hacking reflected the need for a permanent committee dedicated to cyber security. It was not clear how the House of Representatives would respond to the hacking and calls for investigations. House committees have not announced plans for hearings, and Republican House Speaker Paul Ryan issued a statement criticizing Russia but blasting what he termed “exploiting the work of our intelligence committee for partisan purposes.” Though congressional Republicans support a probe of Russia’s involvement in the election, they have shied away from agreeing with the CIA’s assessment that the hacks were deliberately carried out to undermine Clinton. “It’s obvious that the Russians hacked into our campaigns,” McCain said Monday in an interview with Reuters. “But there is no information that they were intending to affect the outcome of the election, and that’s why we need a congressional investigation.” Separately on Monday, one Republican and nine Democratic electors led by the daughter of the House Democratic leader, Nancy Pelosi, wrote to James Clapper, the U.S. Director of National Intelligence, requesting a briefing on the hacking reports before the Electoral College formally decides the election on Dec. 19. John Podesta, chairman of Clinton’s presidential campaign, said in a statement that the campaign supported the electors’ letter, which raises “very grave issues involving our national security.” Clapper’s office did not respond to a request for comment about the letter.   Charles Schumer, who will be the Senate Democratic leader next year, said he welcomed McConnell’s support for “a deep and thorough bipartisan investigation” with access to all relevant intelligence. Trump and his staff have repeatedly dismissed the reports as “ridiculous,” blaming them on Democrats unhappy that Trump won. “Can you imagine if the election results were the opposite and WE tried to play the Russia/CIA card,” Trump said on Twitter on Monday. “It would be called conspiracy theory!” A second tweet said, “Unless you catch ‘hackers’ in the act, it is very hard to determine who was doing the hacking. Why wasn’t this brought up before election?” White House press secretary Josh Earnest on Monday pointed to a public statement from the intelligence community in early October that concluded the hacking had been authorized by “Russia’s senior-most officials” and was aimed at sowing discord in the U.S. election.  That statement stopped short of alleging that Russia wanted to help Trump. But Earnest suggested on Monday that may have been the intent. “You didn’t need a security clearance to figure out who benefited from malicious Russian cyber activity,” Earnest said.  “The president-elect didn’t call it into question. He called on Russia to hack his opponent. He called on Russia to hack Secretary Clinton.”","subject":"politicsNews","date":"December 12, 2016 ","label":1},"truncated_cells":[]},{"row_idx":52,"row":{"Unnamed: 0":18375,"title":"WATCH: HILARIOUS Video Shows Reddit User Apologizing To “Terror Organization” CNN After They Threatened To “Out” Him To Public","text":"When CNN, who is owned by multi-billion dollar corporation Time-Warner threatened to  out  a private individual for doctoring a wrestling video of Donald Trump and replacing his face with a CNN logo, most Americans were stunned.#VeryFakeNewsCNN is likely going to rue the day they threatened a Reddit user that they would expose his identity to leftist thugs, as punishment for doctoring a video to make it look like CNN was being body-slammed by Donald Trump.My totally not forced apology to the great and truthy @CNN. #cnnblackmail pic.twitter.com/N9rmHs9ztS  Brandon Morse (@TheBrandonMorse) July 5, 2017Wikileaks founder Julian Assange reminded CNN in a tweet that they committed a crime when they threatened the Reddit user. Assange cited the violation: 135.60 of the New York criminal code. Memes are showing up all over the place on social media mocking CNN s threat. Even worse, in some cases, the memes are resurrecting news stories that CNN would rather not see repeated on social media, like the the story about former CNN guest host Kathy Griffin s not-funny photos of herself holding an ISIS inspired, decapitated, bloody head of President Donald Trump. CNN fired Kathy Griffin, but not before they defended her on their network, which quickly earned them the trending hashtag #CNNisISIS on Twitter.Earlier today, we reported on a video that has just been released where CNN s logo is replacing the head of President Trump who s being assassinated in a Central Park  Julius Caesar  play.LOL! NEW VIDEO Emerges Of Central Park Trump Assassination Play With CNN Logo Covering Trump s Head [VIDEO]","subject":"left-news","date":"Jul 6, 2017","label":0},"truncated_cells":[]},{"row_idx":53,"row":{"Unnamed: 0":7990,"title":"Washington Post calls for Maine governor to resign","text":"The Washington Post on Wednesday called on Maine Governor Paul LePage to resign, following a series of incidents in which the two-term Republican made racially charged statements and threatened a Democratic lawmaker in an obscenity-laden email. LePage, whose term extends through 2018, last month lashed out at a state lawmaker who criticized his comments blaming black and Hispanic people from out of state for the heroin trade in Maine. In an editorial titled “Maine’s unhinged governor,” the newspaper wrote “LePage threatens to remake his state’s image from a vacation paradise of surreal natural beauty to a hotbed of hatred.” LePage had told reporters he had collected a three-ring binder of people arrested for trafficking drugs in the state and that 90 percent of those in it were black or Hispanic. The governor released the binder this week and a review by local media found that closer to one in three arrestees in it matched LePage’s description. Maine legislative leaders last month briefly considered convening a special session to reprimand LePage for the outburst, but the effort collapsed with the two parties unable to agree on whether they wanted to censure him or pursue impeachment. A spokeswoman for the governor dismissed the editorial as biased. “The Post did not contact anyone from the governor’s office to fact-check this biased piece of propaganda,” spokeswoman Adrienne Bennett said in an email. “Clearly, the Post editorial board is exempt from reporting facts.” Asked about what factual inaccuracies in the editorial concerned the governor, Bennett challenged the Post’s description of LePage declining to attend a 2011 Martin Luther King Jr. Day event hosted by the state’s NAACP chapter, noting that he had instead attended a Rotary Club event honoring the slain civil rights activist. At the time that he declined the NAACP’s invitation, in his first month as governor, LePage said that critics of his decision could “kiss my butt.”","subject":"politicsNews","date":"September 28, 2016 ","label":1},"truncated_cells":[]},{"row_idx":54,"row":{"Unnamed: 0":15124,"title":"France wants Hariri movements' free, able to play role in Lebanon","text":"France s foreign ministry said on Friday it wanted Lebanon s Saad al-Hariri to be free of his movements and fully able to play an essential role in his country.  Our ambassador to Saudi Arabia visited Saad al-Hariri at his home on his return from the trip he made to the United Arab Emirates, to which the (foreign) minister (Jean-Yves Le Drian) referred to this morning,  French deputy foreign ministry spokesman Alexandre Georgini said.  As the minister said, we wish that Saad al-Hariri has all his freedom of movement and be fully able to play the essential role that is his in Lebanon,  he added.  The comments appeared to differ slightly from Le Drian, who said on Europe 1 radio Friday morning, that as far as France was aware Hariri was free of his movements and that it was important he made his own choices.","subject":"worldnews","date":"November 10, 2017 ","label":1},"truncated_cells":[]},{"row_idx":55,"row":{"Unnamed: 0":6449,"title":"Trump to meet Alibaba's Ma, U.S. Senate majority leader, Univision","text":"Republican U.S. President-elect Donald Trump continued holding meetings on Monday in New York as he prepared to take over the White House from Democrat Barack Obama on Jan. 20. Below is a list of meetings for Monday, according to Trump’s transition team and eyewitness accounts. *Chairman and chief executive officer, LVMH     *Founder and executive chairman, Alibaba Group Holding Ltd * U.S. Senate majority leader * Kentucky Republican     * President and CEO Randy Falco [UVN.UL] * Chief News, Entertainment & Digital Officer Isaac Lee * Fox News media host","subject":"politicsNews","date":"January 9, 2017 ","label":1},"truncated_cells":[]},{"row_idx":56,"row":{"Unnamed: 0":8843,"title":"Charles Koch Has The Sads Because He Thinks He Should Have More Influence Over Elections","text":"Charles Koch, the billionaire CEO of Koch Industries has spent hundreds of millions of dollars on political campaigns because of Citizen s United, but he still thinks he should have even more influence.During an interview with the Financial Times, Charles Koch whined that even as he spends tons of money trying to shape the political landscape to his will he still doesn t have as much influence as he expected to have in 2016.Koch says he presented of list of his wishes to Republican candidates, who basically ignored them, which is why he is pouting now. (It) doesn t seem to faze them much,  Koch said.  You d think we could have more influence. It is hard for me to get a high level of enthusiasm because the things I m passionate about and I think this country urgently needs aren t being addressed. In other words, Koch has the sads because he hoped Republicans would automatically be his puppets and support and enact all of his demands.The billionaire polluter actually gave the candidates a freaking LIST of things he wants them to do if they win the presidency and now he thinks he needs even more influence because the candidates didn t seem to give two shits about it.According to Politico, the Koch brothers are poised to spend nearly $1 billion on the 2016 election, in what should be seen as a blatant effort to buy the White House and Congress.Among the many aims on their agenda is the destruction of labor unions, abolishing the minimum wage, dismantling environmental protection laws, and repealing Obamacare while opposing any effort to bring affordable healthcare to the American people. And those are just a few things that the Koch brothers want to do to this country.Charles Koch attempted a run for president in the 1980s, but he failed miserably. Instead, he decided to focus on buying the government instead.But despite his massive influence on Republican politics, Koch is complaining that he still doesn t have enough power over the candidates. In reality, the American people are the ones who should be complaining about not having enough influence over elections, which the Kochs believe they are entitled to buy.If the Koch brothers are wondering why most of the American people see them as villains, this is why.Featured Image: Flickr","subject":"News","date":"January 10, 2016","label":0},"truncated_cells":[]},{"row_idx":57,"row":{"Unnamed: 0":20691,"title":"German citizen on trial in Turkey on political charges: media","text":"A 49-year-old woman has become the first German citizen to stand trial in Turkey on allegations of supporting U.S.-based cleric Fethullah Gulen, whom Turkish authorities blame for a failed military coup last year, German media reported. Broadcasters WDR and NDR and daily newspaper Sueddeutsche Zeitung said the trial began in the southern Turkish city of Karaman on Thursday and cited the indictment as saying the woman faced several years in prison. They said the woman, whom they did not name, was born in Turkey but had lived in southwest Germany for more than 20 years and had been a German citizen for 15. She had been arrested in Turkey in August 2016 and released in September after pressure from Germany s foreign ministry but was not allowed to leave the country, they said. Earlier on Thursday, the ministry confirmed that another German citizen detained in southern Turkey last week had been released but banned from travel. Turkey s Dogan news agency said the man and his German partner had been detained while on holiday in Antalya. The partner had already been freed after questioning. Dogan said the couple had also been held as part of investigations into Gulen and Kurdish militants in Syria. Gulen has denied any link to the failed coup. Thursday s release means 10 German citizens remain in Turkish detention on political charges. The arrests have raised tensions between Ankara and Berlin and led Chancellor Angela Merkel to call for a review of relations and of Turkey s EU accession talks. The detainees include dual German-Turkish citizen Deniz Yucel, who has been held for more than 200 days.","subject":"worldnews","date":"September 7, 2017 ","label":1},"truncated_cells":[]},{"row_idx":58,"row":{"Unnamed: 0":13340,"title":"Turkey's Erdogan to make historic visit to Greece next week","text":"Tayyip Erdogan will travel to Greece on Dec. 7-8, Greek sources said on Friday, in the first visit by a Turkish president in decades that have seen ties at times severely strained over issues from Aegean Sea rights to ethnically-split Cyprus. Erdogan is expected to meet his Greek counterpart and Prime Minister Alexis Tsipras and discuss bilateral relations, security issues and the refugee crisis, following a 2016 EU-Ankara deal aimed at reducing migrant flows to Europe.  He is also expected to visit Thrace in northern Greece, where there is a Muslim minority. Erdogan last visited fellow NAT member Greece in 2010 in his capacity as  prime minister. His visit next week will be the first by a Turkish president to Greece in 65 years.  Greece and Turkey, NATO allies, came to the brink of war in 1996 over the ownership of uninhabited Aegean islets.  Relations have improved since then but they are still at odds over issues from territorial disputes to Cyprus, which remains divided between Greek and Turkish Cypriot communities living on either side of a U.N.-monitored ceasefire line.  Eight Turkish soldiers commandeered a helicopter and flew it to northern Greece as a failed coup unfolded against Erdogan between July 15 and 16, 2016. Turkey has repeatedly demanded Greece hand them over but Greece s highest court has rejected their extradition. Greek police on Tuesday arrested nine Turkish citizens who were later charged with terrorism-related offences. They are accused of hoarding explosives and of links to an outlawed militant organization responsible for suicide bombings in Turkey. They have denied any wrongdoing. [nL8N1NZ39F]","subject":"worldnews","date":"December 1, 2017 ","label":1},"truncated_cells":[]},{"row_idx":59,"row":{"Unnamed: 0":7556,"title":"Texas Gun Nuts Open Fire On Democratic Office Of Gun Control-Supporting Senator","text":"The Houston Police Department and Texas Rangers are investigating after a gun nut opened fire on the office of Democratic state Senator John Whitmire a day before President Obama is scheduled to speak in Austin.Early Thursday morning around 12:30am, a shooter fired several rounds into the two-story office.  There are bullet slugs everywhere,  Whitmire said.  One lodged in a framed picture. It s pretty amazing. Whitemire, a gun control advocate, surmised that the weapon used in the attack was an AR-15 because the bullets were .223 caliber. No one was harmed in the shooting but Whitmire and his staff along with law enforcement officials are taking the incident seriously. We ll take precautions. But it s part of the job, unfortunately, in this day and time,  Whitmire said.  They are checking in this general area to see if anyone else received any gunfire. We don t know yet. I don t know yet. The targeting of Whitmire s office occurred the day before President Obama is scheduled to appear at the South by Southwest tech and music festival on Friday where he is delivered a keynote address.Upon hearing of Obama s schedule, Texas open carry gun nuts stated their desire to attend the event with their guns to hand out pro-law literature. But one of the gun nuts had a different idea for what his buddies should do. If you get a clear shot, please fire for effect!  conservative gun nut Kriss Elliot wrote on Facebook.So not only has the Texas open carry obsession resulted in violence against a Democratic office, it has resulted in gun nuts actually wanting to assassinate President Obama, and now it s much easier for them to do this because they are legally allowed to carry deadly firearms in public view.Make no mistake, these people belong in jail or at the very least an FBI watch list, but as long as Republicans control the state it will remain an exaggerated and embarrassing version of the Wild West.Featured Image: OnlyInYourState.com","subject":"News","date":"March 11, 2016","label":0},"truncated_cells":[]},{"row_idx":60,"row":{"Unnamed: 0":19125,"title":"YOUNG MAN DELIVERS POWERFUL Message To Liberals: “Put down your fists…Take off your masks…If you do not change…you’re going to lose” [VIDEO]","text":"Wow! This young Asian student nails it! He speaks for every American who has been a victim of Obama s failed government experiment. The Left has turned our world upside down and many people in America believe that we are very close to a civil war. This brilliant young Asian student warns the Left to turn back now, warning them it s  a line you don t want to cross.  He blames them for  normalizing violence  and completely ignoring the rule of law as a way to threaten people who don t agree with you.Here is a part of his message that can be seen in the video below: Once you cross that line, you re starting a war you cannot win. You think you re so big and powerful. Step out of your bubble. Step out of the liberal cities, and look at the rest of the country. You re outnumbered, outmanned and outgunned. You cannot win this if it turns violent. If you normalize violence, if violence is okay, you cannot win. You can win by reaching out to conservatives. Talk to them. Talk to  Trump supporters and ask them why they believe what they believe and maybe, maybe you ll find common ground. Maybe you might even convince us to adopt your positions. Who knows? Put down your fists. Take off your masks. Fight with your words, not sticks and stones. Because if you do not change, you re going to lose. You need us on your side. You need to convince us why you re right. You cannot divide us. You need us on your side because Generation Z, the kids that are growing up and being born right now, they re projected to be the most conservative generation in decades, more conservative than your grandparents. These kids are growing up on the internet. The future s in their hands, and they re on our side. So unless you change your ways you ve already lost.","subject":"left-news","date":"Feb 16, 2017","label":0},"truncated_cells":[]},{"row_idx":61,"row":{"Unnamed: 0":6604,"title":"Trump discussed Mideast peace in call with Egypt's Sisi","text":"U.S. President-elect Donald Trump discussed laying the groundwork for peace in the Middle East in a phone call on Thursday with Egyptian President Abdel Fattah al-Sisi, a Trump transition official said. The official did not know whether Trump and Sisi talked specifically about Egypt’s decision to postpone a vote set for Thursday in the U.N. Security Council on a resolution demanding that Israel end settlement building.","subject":"politicsNews","date":"December 22, 2016 ","label":1},"truncated_cells":[]},{"row_idx":62,"row":{"Unnamed: 0":14370,"title":"U.S. envoy to Russia: visa consultations in consulates may resume soon - TASS","text":"Visa consultations in U.S. consulates in Russia could be resumed in the near future, TASS news agency cited U.S. Ambassador to Russia Jon Huntsman as saying on Monday.  I believe that in the near future they (visa consultations) may be resumed,  the agency quoted him as saying.  We are trying to do everything possible, and I hope that in coming weeks we will be able to effectively issues visas.  In August, the United States began to scale back its visa services in Russia, drawing an angry reaction from Moscow three weeks after President Vladimir Putin ordered Washington to more than halve its embassy and consular staff. The U.S. consulates are located in St Petersburg, Yekaterinburg in the Urals and Vladivostok in Russia s far east.","subject":"worldnews","date":"November 20, 2017 ","label":1},"truncated_cells":[]},{"row_idx":63,"row":{"Unnamed: 0":3060,"title":"George Takei Just F*cking HUMILIATED Trump Over His Russian ‘Golden Showers’ Adventure (TWEETS)","text":"In case you have not heard, an addendum to the intelligence report on Russian hacking that was delivered to both President Barack Obama and President-elect Trump has just about something for anyone   including a rather hilarious bit involving The Donald, Barack Obama s bed, and pee. Initial reports surrounding the two-page addendum indicated that a former British spy had obtained a slew of information on Trump including  compromising personal and financial information  obtained by the Russians during Trump s visits to Moscow, but it was not until Buzzfeed got ahold of the former spy s report that things got interesting.Trump had stayed at a Ritz-Carlton in Moscow, where he was allegedly filmed hiring a number of prostitutes to come to his hotel room and urinate on the bed in front of him..@Buzzfeed published a dossier claiming Trump hired  prostitutes to perform a #GoldenShowers show\" and now Twitter is a stream of pee jokes: pic.twitter.com/WdHpZ4HzvV  Fusion (@Fusion) January 11, 2017According to CNN, who did not report the full details initially because the report has not been fully verified by intelligence agencies as of yet, the information comes from someone who is known by United States intelligence and considered to be  credible. Naturally, legendary actor and constant thorn in Trump s side George Takei couldn t resist the opportunity to have some fun with this:Trump gives a new meaning to \"Alfa\" male. #PutinTheFinishingTouches  George Takei (@GeorgeTakei) January 11, 2017You know, Trump never could pass up a golden opportunity.  George Takei (@GeorgeTakei) January 11, 2017Waiting for Trump to whine about yellow journalism. Please oh please oh please  George Takei (@GeorgeTakei) January 11, 2017Tinkle, tinkle, little czar. Putin put you where you are.  George Takei (@GeorgeTakei) January 11, 2017Sorta gives a whole new meaning to \"Wikileaks.\"  George Takei (@GeorgeTakei) January 11, 2017Watching Obama's final address, and realizing how very, very far we are about to descend. Farewell, O Captain my Captain! Heavens save us.  George Takei (@GeorgeTakei) January 11, 2017I wonder if Trump's press conference tomorrow will have a live stream.  George Takei (@GeorgeTakei) January 11, 2017In all seriousness, if Trump has been compromised by Russia, whatever dirt they have, we need a full and independent investigation. Now.  George Takei (@GeorgeTakei) January 11, 2017The report sent Trump into a frenzy, with The Donald tweeting an all-caps, panicky denial in which he once again calls information he doesn t like  fake news  and a  total political witch hunt :FAKE NEWS   A TOTAL POLITICAL WITCH HUNT!  Donald J. Trump (@realDonaldTrump) January 11, 2017While it is important to note that the information is still in the early stages of vetting, Trump has been recorded   willingly and multiple times   admitting that he finds his daughter sexually attractive, so paying some nice Russian ladies to urinate on furniture isn t exactly outside the realm of possibility. While there is nothing wrong with whatever two consenting adults choose to do behind closed doors as long as no one gets hurt, it was well-known at the time that Russian intelligence was monitoring that hotel, so it probably wasn t the best time and place for a piss-party even if Trump did manage to lock down a bed his arch-nemesis Barack Obama had once slept in for the festivities.The summary handed to Barack Obama warns that Trump has been compromised   and if this is the information coming out of it in the early stages, what is to come is likely downright horrifying.Featured image via Getty Images(Kris Connor)/screengrab","subject":"News","date":"January 11, 2017","label":0},"truncated_cells":[]},{"row_idx":64,"row":{"Unnamed: 0":4034,"title":"U.S. FCC chief unveils plan to scrap Obama-era internet rules","text":"The head of the Federal Communications Commission on Thursday released a 58-page draft plan to reverse the landmark 2015 “net neutrality” order and disclosed the agency may withdraw “bright line” rules barring internet companies from blocking, throttling or giving “fast lanes” to some websites. FCC Chairman Ajit Pai, named by Trump in January, disclosed his intent Wednesday to repeal the Obama era rules that reclassified internet service and tightly regulated providers as if they were utilities. The FCC also plans to scrap the 2015 internet conduct standard and an ombudsman position created to hear complaints of net neutrality violations. The plan asks if network disclosure requirements should remain in force for internet providers. Pai’s plan faces an initial May 18 vote. He wants public comment on whether the FCC should keep its “bright line” rules, and said his decision on the rules would depend partly on the comments the agency receives. Websites such as Facebook Inc (FB.O), Alphabet Inc (GOOGL.O) and others back the rules, saying they guarantee equal access to the internet. Internet service providers such as AT&T Inc (T.N), Verizon Communications Inc (VZ.N) and Comcast Corp (CMCSA.O) oppose the Obama order, saying they made it harder to manage internet traffic and discouraged investment in improving access. FCC Commissioner Mignon Clyburn and Federal Trade Commissioner Terrell McSweeny opposed Pai’s plan, saying it “would allow broadband providers to erect barriers or charge tolls to any application, connected device, or website that the broadband providers’ customers want to reach. It would allow broadband providers to favor their own content over others, and pick winners and losers on the internet.” Pai said the 2015 open internet rules were unnecessary because large internet providers did not block websites before they were imposed. “We were not living in some digital dystopia before the partisan imposition of a massive plan hatched in Washington saved all of us,” Pai said Wednesday. The FCC proposal seeks comment “on whether a codified no-blocking rule is needed to protect such freedoms.” The order also asks whether a legal bar on throttling “is still necessary, particularly for smaller providers.” The proposal also questions the ban on “paid prioritization” that the proposal argues was adopted to “address an apparently nonexistent problem.” AT&T said the question “is not whether the internet will remain open - it undoubtedly will. The question is how, as a country, we will regulate the internet ecosystem.”","subject":"politicsNews","date":"April 27, 2017 ","label":1},"truncated_cells":[]},{"row_idx":65,"row":{"Unnamed: 0":1686,"title":"WATCH: Jake Tapper HUMILIATES Trump With The Sad Truth About His Pathetic First 100 Days","text":"Donald Trump recently said that grading his first 100 days is a ridiculous standard, but as Jake Tapper points out, Trump set the standard himself during the campaign.When Mitt Romney ran for president in 2012, he quickly made a name for himself as a serial flip-flopper. Well, Donald Trump is flip-flopping even more.Throughout the 2016 campaign, Trump made a lot of promises about what he would get done during his first 100 days, even going so far as to present a 100 days action plan listing what Americans could expect him to accomplish during that period.But now that his first 100 days winding down, Trump realized that he is a total failure and quickly posted a tweet designed to make it sound like the first 100 days standard is no big deal.No matter how much I accomplish during the ridiculous standard of the first 100 days, & it has been a lot (including S.C.), media will kill!  Donald J. Trump (@realDonaldTrump) April 21, 2017Trump has even released a list of his so-called  historic accomplishments  to make it appear like he has done great things since taking over the White House.Jake Tapper was not impressed and it only took him four minutes to take Trump down on Monday night.The CNN host began informing Trump of his record low approval ratings and pointed out that not a single major piece of legislation has been signed despite Republicans controlling Congress. With historically low approval ratings and zero pieces of major legislation signed into law, President Trump has had an empirically disappointing first 100 days. Perhaps that s the reason he recently tweeted about the  ridiculous  standard of the first 100 days. Indeed, Trump often brags about himself and whines about the media when they tell the truth about him.Tapper then demonstrated Trump s hypocrisy by showing clips of him repeatedly bragging about how much he would get done in the first 100 days. In other words, Trump held himself to the standard that he now claims is  ridiculous. He changed his tune on this marker this very conceit that he promoted with his 100-day action plan,  Tapper continued.  Which is not really a surprise, because President Trump often heralds his flexibility. Tapper went on to hit Trump for flip-flopping on all of his positions during the campaign, like when he said that  NATO is obsolete,  only to turn around and admit that NATO is not obsolete after coming face to face with NATO officials. Then there was the time Trump dismissed the unemployment rate as  phony,  which was under 5 percent during the campaign, only to brag about the same numbers when the first jobs reports came out under his presidency.Then there s healthcare, which Trump bragged would be easy to deal with during the campaign. He promised Americans would get cheap healthcare. Now, he admits it s  complicated  after failing to repeal the popular Affordable Care Act.Trump also failed to cripple a Syrian air base he ordered bombed. Botched a raid in Yemen that left a soldier, an American girl, and many civilians dead. His two immigration bans have been blocked by the courts, and a government shutdown looms because Trump refuses to budge on funding his useless border wall.In the end, Tapper also hit Trump for complaining about executive orders during the campaign, only to sign 25 within his first 100 days, more than any president since World War II. In fact, Trump is on pace to sign more executive orders than President Obama. Trump is also on pace to take more vacations days, spend more taxpayer dollars on those vacation days, and play more rounds of golf.Here s the video via YouTube.Donald Trump is a loser. That s the one word that best sums up Trump and his disastrously embarrassing first three months in office.Featured Image: Screenshot","subject":"News","date":"April 25, 2017","label":0},"truncated_cells":[]},{"row_idx":66,"row":{"Unnamed: 0":2241,"title":"Trump declares national emergency on opioid abuse","text":"U.S. President Donald Trump on Thursday declared the opioid epidemic a national emergency and said his administration was drafting papers to make it official. “The opioid crisis is an emergency and I’m saying officially right now it is an emergency,” Trump told reporters in New Jersey. “We’re going to draw it up and we’re going to make it a national emergency. It is a serious problem, the likes of which we have never had.” Trump spoke about a week after a White House commission on the opioid crisis led by New Jersey Governor Chris Christie recommended the president declare it a national emergency. The declaration could help unlock more support and resources to address the drug overdose epidemic, such as additional funding and expanded access to various forms of treatment, and it gives the government more flexibility in waiving rules and restrictions to expedite action. National emergencies are typically declared for short-term crises, such as the Zika virus outbreak or a natural disaster. It is unclear what Trump’s declaration will mean for a complex, long-term public health problem.  “We’re going to spend a lot of time, a lot of effort and a lot of money on the opioid crisis,” Trump said. “This is a worldwide problem, not just a United States problem.” More than 100 Americans die of drug overdoses every day, the commission wrote in a report, noting that “America is enduring a death toll equal to September 11th every three weeks.” Opioids played a role in more than 33,000 deaths in 2015, according to the U.S. Centers for Disease Control and Prevention. Trump held a “major briefing” on the epidemic on Tuesday, but stopped short of following the commission’s recommendation. Instead, he talked mostly about stopping the flow of drugs into the United States and ensuring young people never start using drugs. He did not discuss access to treatment.","subject":"politicsNews","date":"August 10, 2017 ","label":1},"truncated_cells":[]},{"row_idx":67,"row":{"Unnamed: 0":12177,"title":"Mexico enshrines army's role in drug war with divisive law","text":"Mexico s Congress on Friday approved a law that enshrines the use of the army in the country s long war against drug cartels, overriding protests from the United Nations rights body and activists who fear it will encourage abuses by the military. The ruling Institutional Revolutionary Party and some members of the center-right opposition National Action Party backed the bill, which now will head to President Enrique Pena Nieto s desk to be signed into law. Known as the Law of Internal Security, the bill establishes rules for the military s role in battling drug gangs, a conflict that has claimed well over 100,000 lives in the last decade. The military has been mired in several human rights scandals, including extra-judicial killings of suspected gang members and the 2014 disappearance of 43 students near an army base. Supporters of the legislation say it will set out clear rules that limit the use of soldiers to fight crime. Rights groups are not convinced, saying the bill empowers security forces instead of improving the police and could usher in greater abuses and impunity. The United Nations, Amnesty International and Mexican human rights organizations all lobbied lawmakers not to pass the bill.","subject":"worldnews","date":"December 15, 2017 ","label":1},"truncated_cells":[]},{"row_idx":68,"row":{"Unnamed: 0":1171,"title":"Trump Tweets About His Impeachment Chances In Latest (And Perhaps Greatest) Self-Own","text":"Nothing betrays your official narrative that your administration is functionally well and you are not a crook like tweeting assurances from Fox News that your chances of being impeached are only slim. One might argue that frantically insisting that you are probably not going to get impeached only makes the notion that you probably are all the more reasonable. No sane president would get caught doing something so desperate.But Trump woke up and did just that.In another humdinger to add to a series of self-owns, Trump retweeted a video of Fox News host Geraldo Rivera insisting that Trump s chances of being impeached went from  3 percent  (a number he pulled out of thin air) to  0 percent  (another number he pulled out of thin air). In doing so, Trump inadvertently acknowledged that his chances of being impeached weren t zero before and are only zero now if you listen to the network that operates as state media for his administration.Trump s self-incrimination is a nice reminder of how troubled his administration is. In an effort to spin the testimony of the former FBI director he recently inappropriately fired, he is reduced to leaning on Fox News to make the case that the hearing didn t prove he was trying to obstruct justice (as most neutral observers noted) but actually it  vindicates  him   somehow. It s a line of spin so patently absurd that even conservative pundits are having a hard time trumpeting it with a straight face.Enter Rivera. The longtime shockjock is, of course, among the least reputable men in journalism. His legendary fails include botching the opening of Al Capone s vault on live television, getting kicked out of Iraq after revealing U.S. troop positions to the enemy on live television, and saying Travyon Martin brought his murder on himself for wearing a hoodie   on live television. Put Rivera in front of a camera, broadcast it live, and chances are he will do something to humiliate himself. He has become one of Trump s biggest defenders.It says something about Trump s chances of making it through his first term without being thrown out of office that he s just a few months in and already he s been reduced to using disreputable Fox hosts like Rivera to defend him. The fact that nobody else will risk destroying their reputation to stand up for him speaks volumes. Luckily, Trump is just dimwitted enough to keep reminding us of his precarious situation because he is fundamentally incapable of not tweeting incredibly stupid things each day.Featured image via Michael Reynolds-Pool/Getty Images","subject":"News","date":"June 12, 2017","label":0},"truncated_cells":[]},{"row_idx":69,"row":{"Unnamed: 0":14427,"title":"Algeria picks up 286 boat migrants en route to Europe","text":"Algeria s coastguard has picked up 286 illegal migrants heading across the Mediterranean to Europe by boat, the Defence Ministry has said. The migrants were detained on several boats between Thursday and Saturday, according to a ministry statement carried on Sunday by the state news agency, APS. Algeria has so far seen relatively few attempts to cross to Europe by boat, compared to the hundreds of thousands of mostly African would-be migrants who have set off in search of prosperity or security from elsewhere along the north African coast, mostly from Libya. Most illegal crossings from Algeria take place in summer, when sailing conditions are more favorable. Neighboring Tunisia has recently seen a surge in such departures as young unemployed people seek work in Italy. Algeria s economy is also suffering as its vital energy revenues have been hit by a sharp fall in prices.","subject":"worldnews","date":"November 19, 2017 ","label":1},"truncated_cells":[]},{"row_idx":70,"row":{"Unnamed: 0":3349,"title":"U.S. spy agencies probe another flank in Russian hacking","text":"Russian hacking of the 2016 U.S. election included sophisticated targeting of state officials responsible for voter rolls and voting procedures, according to a top secret U.S. intelligence document that was leaked and published this week, revealing another potential method of attempted interference in the vote. The month-old National Security Agency document outlined activities including impersonating an election software vendor to send trick emails to more than 100 state election officials. Analysts at the NSA believed the hackers were working for the Russian military’s General Staff Main Intelligence Directorate, or GRU, according to the document. The document’s publication on Monday by The Intercept, a news outlet that focuses on security issues, received particular attention because an intelligence contractor, Reality Leigh Winner, was charged the same day with leaking it. U.S. intelligence agencies have previously said the Kremlin tried to influence the election outcome in favor of Republican candidate Donald Trump through leaks during the campaign of hacked emails from Democratic Party officials, aimed at discrediting Democratic candidate Hillary Clinton. The new revelations suggest that U.S. investigators are also still probing a more direct attempt to attack the election itself, and a federal official confirmed that is the case. However, there is no evidence that hackers were able to manipulate votes, or the vote tally. The document says at least one employee of the software vendor had an account compromised but does not cover whether any of the elections officials were also successfully compromised. If they did compromise the officials, hackers could have planted malicious software, then captured proof of the infection to suggest that there had been fraud on Clinton’s behalf, had she won the Nov. 8 election, experts said. “If your goal is to disrupt an election, you don’t need to pick the winner or actually tamper with tally result,” said Matt Blaze, a University of Pennsylvania computer science professor who has written on the security of voting machines. Simply casting doubt on the legitimacy of the results could achieve the goals of a government-sponsored hacking campaign, he said.  U.S. intelligence officials had previously stated that Russian intelligence had won access to “multiple” election officials but had said that compromised machines were not involved with vote tallies. But they had not said how sophisticated and extensive the effort was or how it worked. Russian President Vladimir Putin has strongly denied Russian government involvement in election hacking, though he said last week that “patriotic” Russians could have been involved. Trump has denied any collusion. SPEAR-PHISHING ON ELECTIONS OFFICIALS The newly leaked NSA report said the hackers used so-called “spear-phishing” techniques on election officials, trying to convince targets to click on links in emails that seemed to come from legitimate correspondents. The report describes just one phishing campaign, which hit state officials a week before the election, but does not give any locations or say if it was successful. Although there may have been many others, security experts said one coming so late in the game would be more likely to be about sowing chaos than  trying to alter vote counts.  The report did not say what the hackers were trying to accomplish, and any investigation of the computers of people who were targeted would be the jurisdiction of the FBI. An FBI spokeswoman declined to comment Tuesday, as did the office of the special counsel Robert Mueller, who is investigating possible collusion between Trump campaign officials and the Russian government. The “bait” used in the spear-phishing campaign involved software for managing voter registration rolls. The hackers might have been considering deleting some records and forcing officials to turn legitimate voters away, said elections technology security expert Alex Halderman, of the University of Michigan. There were no wide reports of mass rejections of voters, so perhaps that plan was abandoned or proved too hard to execute, he said. It is also possible that the idea was to get onto the machines of officials who oversaw both registration and voting software. Elections are run by counties in the United States.  “Depending on the county’s configuration and security practices and what is separated from what, they could have access to potentially every aspect, from lists of registered voters, to voting  machines, to firmware on those machines, to the ballots that are presented, to the software that controls the final tally,” Blaze said. “This is the holy grail of what an attacker would want to compromise.”  Members of Congress said they hoped to learn more about the hacking attempts. “It’s important that the American people understand that the Russian attempts to break into a number of our state voting processes - we talked about this in the fall - was broad-based,” Democrat Mark Warner, vice chairman of the Senate Intelligence committee, told reporters. “It’s my hope in the coming days that we can get more information out about that.”","subject":"politicsNews","date":"June 7, 2017 ","label":1},"truncated_cells":[]},{"row_idx":71,"row":{"Unnamed: 0":17512,"title":"EU plans Brexit summit gesture, May hints on cash","text":"Britain will be offered a goodwill gesture at a European Union summit next week, European nations agreed on Friday, seeking to break the deadlock over Brexit, but no watering down of their demand for tens of billions of euros they say Britain owes. British Prime Minister Theresa May also indicated she might make a move at next week s summit. A spokeswoman said  there will be more to say there  on a promise May made last month to honor financial commitments when Britain leaves. Both sides are making the moves to end an apparent stalemate in talks on Britain s leaving the EU.  At heart is a proposal by summit chair Donald Tusk to tell May next week that the EU will start internal work on a post-Brexit transition plan.  This is a very big gesture towards Britain, maybe way too big,  a senior EU diplomat said ahead of an evening meeting of envoys from the 27 remaining states to discuss Tusk s draft for a statement to made after leaders meet in a week s time. Ambassadors broadly agreed the plan on Friday despite scepticism, including from powerhouse Germany. They requested some harder language to ram home that any offer is conditional on Britain making progress toward agreeing Brussels  terms.  Time is running out , German Chancellor Angela Merkel s spokesman had warned after week of stalemate in negotiations and faction-fighting within May s government that have raised concerns that talks could collapse, leaving Britain bumping out into legal limbo in March 2019. Hammering the point, EU chief executive Jean-Claude Juncker said in Luxembourg:  They have to pay. They have to pay.  Underscoring tensions, British finance minister Philip Hammond referred to the EU as  the enemy  at one point, but then apologized. His remark came as he defended himself against accusations from hardline Brexit supporters who say he is soft on Brussels. Businesses planning investment decisions are calling for a clear idea by the new year of how the split and subsequent years of transition to a new trade relationship will function. Otherwise, some firms say, they may assume a disruptive  hard Brexit  and move some operations to continental Europe. As the process approaches the half-way stage between last June s referendum vote for Brexit and Britain s departure on March 30, 2019, tensions are building not just between the two negotiating sides but also within the bloc of 27. While hardliners would prefer less or no talk of a future after Brexit and more about demanding money, others are keen to give May, beleaguered at home, something to show for the effort to compromise she displayed in a speech at Florence last month. One diplomat called the draft a  search and rescue mission  to help the British premier out of a jam. Another said it was a bid to break  stalemate  and avert  disaster  over the winter:  Some states were not very happy about this but what else can we do?  the diplomat added.  We are trying to reach out.  But then the diplomat added:  They must come up with something on the money.  Diplomats said Germany and France coordinated on Friday , to limit any watering down of the EU position that its negotiator, Michel Barnier, cannot so much as mention to his British counterparts what might come after Brexit until leaders deem there has been  sufficient progress  on three issues the EU says must be settled before Britain leaves. These are the rights of EU citizens in Britain, Northern Ireland s new EU border and the intractable  Brexit bill . Tusk, who met Merkel and French President Emmanuel Macron in a week when he has spoken to almost all other EU leaders including May, offered a draft text saying there is not enough progress but welcoming the advances there have been and flagging a hope that the next summit in December could open trade talks. In its strongest conclusion, it proposes that Barnier start working out internally - without negotiating with London - what will happen after Brexit. Barnier himself has sought flexibility to break the deadlock, diplomats say.  If this is the concession May needs to be able to make a move on financial settlement, let s try it,  said a diplomat from one of Britain s close EU trading partners.  She is so weak at the moment she can do nothing. And we need the money.  Despite protestations of unity, some diplomats detect nuance in approaches to the prospect of talks collapsing, with those countries with most to lose from trade barriers with Britain most keen to avert a meltdown. Essentially that means its near neighbors like the Nordic states, the Netherlands and Ireland.","subject":"worldnews","date":"October 13, 2017 ","label":1},"truncated_cells":[]},{"row_idx":72,"row":{"Unnamed: 0":3674,"title":"Trump EXPLODES, Attacks Jill Stein Over ‘Ridiculous Recount’ That Could Change Election Results (TWEET)","text":"Despite the fact that many election experts have been hoping that the 2016 election results would be examined, Democratic candidate Hillary Clinton is being attacked by the Trump campaign for supporting the efforts of Green Party candidate Jill Stein to recount the votes in Wisconsin, Michigan and Pennsylvania.Earlier today, Trump campaign manager Kellyanne Conway unloaded on Clinton s campaign   but Trump couldn t just leave it at that. Shortly after Conway criticized the recount effort, Trump chimed in with a statement of his own. In Trump s response, he blamed Stein and the Green Party for their  ridiculous  recount  scam  and accused Stein of trying to profit from it. Trump said: The people have spoken and the election is over, and as Hillary Clinton herself said on election night, in addition to her conceding by congratulating me,  We must accept this result and then look to the future. It is important to point out that with the help of millions of voters across the country, we won 306 electoral votes on Election Day   the most of any Republican since 1988   and we carried nine of 13 battleground states, 30 of 50 states, and more than 2,600 counties nationwide   the most since President Ronald Reagan in 1984. This recount is just a way for Jill Stein, who received less than one percent of the vote overall and wasn t even on the ballot in many states, to fill her coffers with money, most of which she will never even spend on this ridiculous recount. All three states were won by large numbers of voters, especially Pennsylvania, which was won by more than 70,000 votes. This is a scam by the Green Party for an election that has already been conceded, and the results of this election should be respected instead of being challenged and abused, which is exactly what Jill Stein is doing. Trump is right that Clinton conceded the election, but she s not legally bound to that   and it s especially insane that Trump would use her concession as part of his argument because he once said he wouldn t concede. Another glaring mistake in Trump s argument is his  the people have spoken  statement, which is hilarious considering Clinton won the popular vote by a landslide, as The Atlantic s David Frum pointed out:TwitterIn Wisconsin, there have already been four precincts that were reported to have discrepancies. Trump and his team are not hiding their anxiety over this issue very well, and they have every reason to be worried.Featured image via Win McNamee and Ty Wright / Getty Images","subject":"News","date":"November 26, 2016","label":0},"truncated_cells":[]},{"row_idx":73,"row":{"Unnamed: 0":11298,"title":"Putin critic Navalny calls election boycott rallies","text":"Opposition leader Alexei Navalny announced on Wednesday a series of rallies across Russia in January to press home his call for a boycott of next year s presidential election, a move likely to draw a sharp response from the Kremlin and police. Navalny unveiled his plan hours after President Vladimir Putin, who polls suggest is a shoo-in for re-election, registered his candidacy at the central election commission ahead of the March 18 vote.  The commission ruled on Monday that Navalny was not eligible to run against Putin due to a suspended prison sentence.  A furious Navalny, who says the sentence was part of a fabricated case designed to thwart his political ambitions, responded by calling for an election boycott. That prompted the Kremlin to demand an investigation to determine whether his statement broke the law. On Wednesday, Navalny upped the ante, saying he and his supporters would organize nationwide rallies on Jan. 28 in 85 towns and cities, including Moscow and St Petersburg, to support his call for an election boycott.  We refuse to call the reappointment of Putin an election,  Navalny said in a statement on his website.   We are not going to vote and will convince everyone around us not to vote. We are going to campaign (for a boycott) with all our might.  A boycott could pose a problem for the Kremlin which is keen to ensure a high turnout in the election to help confer legitimacy on Putin s expected victory amid some signs of apathy among voters. Under Russian law, the time and place of rallies must be agreed with the authorities who have often declined to authorize them in the past, citing conflicting events or security concerns. When the opposition has gone ahead anyway, the police have broken up rallies by force and detained attendees.        Polls show that Putin, who has led Russia for 18 years as either president or prime minister, is on course to comfortably win another six-year term, allowing him to rule until 2024, when he ll turn 72. The former KGB officer is running as an independent, a move seen as a way of strengthening his image as a  father of the nation  rather than as a party political figure. The ruling United Russia party, which he once led and which controls three quarters of seats in the lower house of parliament, has said it will support him, as will Just Russia, a pro-government center-left group. Allies laud Putin for restoring national pride and expanding Moscow s global clout with interventions in Syria and Ukraine. But Navalny says Putin has been in power too long and that his support is artificially maintained by a biased state media and an unfair system which excludes genuine opponents.   Navalny has made a name for himself by successfully leveraging social media and conducting high profile corruption investigations into senior officials. He has also organized some of the biggest anti-government protests in years. Opinion polls, whose accuracy Navalny dismisses, put his support in single digits while giving Putin an approval rating of around 80 percent.","subject":"worldnews","date":"December 27, 2017 ","label":1},"truncated_cells":[]},{"row_idx":74,"row":{"Unnamed: 0":13544,"title":"Britain summons North Korean ambassador over missile test","text":"The British Foreign Office said it had summoned the North Korean ambassador to condemn Wednesday s ballistic missile test.  North Korea said it had successfully tested a new intercontinental ballistic missile in a  breakthrough  that put the U.S. mainland within range of its nuclear weapons.  I summoned the North Korean Ambassador to the Foreign Office to make clear to him our condemnation of this latest ballistic missile test,  Minister for Asia and Pacific Mark Field said in a statement.  North Korea claims it wants to bring security and prosperity to its people. But its actions are creating only insecurity and deepening its isolation,  said Field. Britain is a permanent member of the U.N. Security Council. The latest test was the highest and longest any North Korean missile had flown, and it landed in the sea near Japan.","subject":"worldnews","date":"November 29, 2017 ","label":1},"truncated_cells":[]},{"row_idx":75,"row":{"Unnamed: 0":17488,"title":"Pakistan official details car chase that freed kidnapped U.S.-Canadian family","text":"Pakistani troops shot out the tyres of a vehicle carrying a kidnapped U.S.-Canadian couple and their children in a raid that led to the family s release after five years of being held hostage, a Pakistani security official said on Friday. U.S. drones were hovering near the northwestern Pakistani area where American Caitlan Coleman, her Canadian husband Joshua Boyle and their three children, all born in captivity, were freed, another security official said. Coleman and Boyle were held by the Taliban-linked Haqqani network after being kidnapped while backpacking in Afghanistan, and their rescue marked a rare positive note in often-fraught U.S.-Pakistan relations. The family flew out of Pakistan on Friday, according to a Pakistani airport official who saw them. It was not clear whether they were bound for Canada or the United States. A senior Pakistani security source on Friday detailed how the family were freed following a car chase in the northwestern tribal region bordering Afghanistan. He said Pakistani troops and intelligence agents, acting on a U.S. intelligence tip, zeroed in on a vehicle holding the family as they were being moved into Kurram tribal agency near the town of Kohat, some 60 km (37 miles) inside Pakistan. Agents from Pakistan s Inter Services Intelligence (ISI) spy agency and soldiers attempted to intercept the vehicle, but it sped away, according to the security source.  Our troops fired at the vehicle and burst its tyres,  he said, declining to be identified because he is not authorised to speak openly to the media. The kidnappers managed to escape, the security official added, saying the troops wouldn t fire at the fleeing captors for fear of harming the hostages. The army recovered the hostages safely from the car. Army spokesman Major General Asif Ghafoor told NBC News that the vehicle s driver and another militant had escaped to a nearby refugee camp. The family s rescue has been hailed by U.S. President Donald Trump as a  positive moment  for U.S.-Pakistan relations, which have frayed in recent years amid Washington s assertions that Islamabad has not been doing enough to tackle Haqqani militants who are believed to be on Pakistani soil. Trump, in a statement, said the release of the hostages showed Pakistan was acquiescing to  America s wishes for it to do more to provide security in the region . A second Pakistani security official, speaking on condition of anonymity, said U.S. drones on Wednesday had been seen circling Kohat, suggesting U.S. co-operation included sophisticated surveillance inside Pakistan. Kohat is deep inside Pakistani territory, next to the eastern edge of Kurram agency in Khyber-Pakhtunkhwa province  - outside the Afghan frontier zone where U.S. drones have in the past been tolerated by Pakistan. The U.S. embassy and the Pakistani military did not comment on the drone report. However, a Taliban commander in Pakistan with knowledge of the hostage family said U.S. drones flying in the area prompted their captors to move them.  We took care of this family like our own family members and special guests, but after frequent flying of U.S. drones on Kurram tribal region and its adjoining areas, it was decided to move them to a safer place,  said the Taliban official on condition of anonymity.  They were being shifted to a safer place when captured by the Pakistani forces.   Pakistani officials bristle at U.S. claims Islamabad is not doing enough to tackle Islamist militants, particularly the Haqqanis. After the release of the family, they emphasised the importance of co-operation and intelligence sharing by Washington, which has threatened to cut military aid and other punitive measures against Pakistan. Pakistan s military indicated the family were rescued shortly after entering Pakistan from Afghanistan, and a government official repeated that assertion on Friday.  We have been taking on the terrorists... So we have taken action based on the intelligence that was provided by the U.S. side,  said Foreign Ministry spokesman Nafees Zakaria. He added that he had no other details on the operation  maybe because they were abducted in Afghanistan, they were there in Afghanistan, and that could be the reason why you have not heard much about it . However, two Taliban sources with knowledge of the family s captivity said they had been kept in Pakistan in recent years. A U.S. government source in Washington also said there was no indication the family had been in Afghanistan. The Haqqani network operates on both sides of the porous Afghan-Pakistani border but senior militants have acknowledged they moved a major base of operations to Kurram agency in the tribal areas. The United States and Afghanistan say that safe havens inside Pakistan allow the Taliban, including the Haqqani network, to plan and launch attacks against the Western-backed Afghan government and U.S. and other foreign troops that support them. The Taliban have been fighting for 16 years to re-establish their ultra-Islamist regime that was toppled in a U.S.-backed military operation over sheltering the al Qaeda terrorist network that planned the Sept. 11, 2001, attacks on U.S. cities.","subject":"worldnews","date":"October 13, 2017 ","label":1},"truncated_cells":[]},{"row_idx":76,"row":{"Unnamed: 0":17076,"title":"'We're not Catalonia': Italy's separatists tread softly toward autonomy","text":"As nervous investors retreat from Catalonia, afraid the wealthy region may secede from Spain, another European region whose politicians once campaigned for independence is looking to attract some of them   by talking of autonomy, not secession. The Italian region of Lombardy, the country s industrial engine and home to its financial capital Milan, is holding a referendum on Sunday for more autonomy, an outcome its once-proudly secessionist leader hopes will lure more investment. That could come at the expense of Catalonia, which is a rival to Lombardy in the race to attract employers fleeing another painful European divorce, Brexit. The two regions are competing to host Europe s drugs regulator which must leave the UK and find a new home inside the European Union.  We are not Catalonia,  said Lombardy President Roberto Maroni, overlooking Milan from his glass-walled office on the 36th floor of the region s recently built headquarters.  We remain inside the Italian nation with more autonomy while Catalonia wants to become the 29th state of the European Union. We, no. Not for now.  He speaks of Catalonia as a competitor in some respects but says he is not deliberately courting its firms.  We are not cheering because firms are fleeing Catalonia. We will see what happens but I haven t had any requests yet from Catalan firms.  Maroni is a leading member of Lega Nord, which began in the 1990s to campaign for an independent state of Padania, stretching across Italy s north, roughly following the Po river from around Lombardy in the west to Venice in the east. Lega Nord no longer actively campaigns for secession but as the ruling party in Lombardy and in the Veneto region around Venice, it is holding referendums in both for greater autonomy, including a better financial deal from the central government. A  yes  vote would not be binding on Rome, but Maroni said it would give him a strong mandate to negotiate a better deal.  It s obvious that the more negotiating power I have, the more money I can manage to bring home,  he said. Rome says the referendum is unnecessary, though permitted under Italy s constitution, which allows regions to open talks for more autonomy. Italy s ruling Democratic Party is also neutral on the issue, though at least one of the party s mayors in Lombardy is calling for a  yes  vote. Like Catalonia, Lombardy makes up a fifth of the national economy and complains that the center is draining its finances. But unlike Catalonia, where hundreds of firms have shifted headquarters to other regions of Spain since an Oct. 1 independence referendum there, Lombardy s boss is taking a softer line and using his autonomy push as an investment pitch. Maroni says Lombardy pays 54 billion euros ($64 billion) more in taxes to Rome each year than it receives from the center. He wants to reduce that difference by half. Maroni says he would spend some of that money on research and development, nurturing family-owned businesses and start-ups   and tax holidays to attract big international firms. For example, he said, he could tell big multinationals looking to invest in Europe:  You know that if you come to Milan, for two or three years I won t make you pay taxes.  Rome, though, is in no position to allow its most economically powerful region such a windfall without risking economic collapse in the already-poor south, experts say.  It s a zero-sum game,  said Professor Luca Ricolfi, an expert on federalism at the University of Turin. Gian Claudio Bressa, junior minister for regional affairs in Rome, said it was not a matter of just handing back money. Regions must show they can take over public services from the national government and do a better job at providing them. Only then are more funds allocated to a newly autonomous region, to help it fund those additional services.  Italy is a unitary state based on mutual fiscal solidarity among regions,  Bressa said.  In order to get more money from the central state, Lombardy should demonstrate that the services offered are better if compared to those provided by the state itself. If 27 billion euros were to be used to fund something different from services, Italy could not survive of course.  Even if there is a large  yes  vote in Sunday s referendums, experts do not expect quick or dramatic change. Lombardy would consider it a victory if it managed to pick up a few more responsibilities and around 1-2 billion euros in additional funds, said the University of Turin s Ricolfi. Politically, though, it could inflame tensions between the rich north and poor south, and weaken the seams of a nation that was a collection of small regional states, speaking a variety of dialects, until unification in the 19th century.  Once you open up the issue of what the northern regions pay, then I expect a backlash in southern Italy,  said Giovanni Orsina, history professor at Rome s Luiss-Guido Carli University. ($1 = 0.8504 euros)","subject":"worldnews","date":"October 19, 2017 ","label":1},"truncated_cells":[]},{"row_idx":77,"row":{"Unnamed: 0":6937,"title":"Duterte says felt rapport with Trump, assures U.S.-Philippines ties intact","text":"Philippines leader Rodrigo Duterte described as “encouraging” his phone call with U.S. President-elect Donald Trump on Friday, during which he felt a rapport between them and gave assurance that ties were intact, despite a period of rocky relations. Trump’s seven-minute chat with the firebrand Philippine president follows months of uncertainty about one of Washington’s most important Asian alliances, stoked by Duterte’s hostility towards President Barack Obama and repeated threats to sever decades-old defense ties. Duterte’s anger was unleashed following Obama’s concerns about possible human rights abuses in his war on drugs, during which more than 2,000 people have been killed. Duterte said Trump was “sensitive” and understanding about his crackdown and was encouraged by what he interpreted as Trump’s indication he would not interfere. “I could sense a good rapport, an animated President-elect Trump. And he was wishing me success in my campaign against the drug problem,” Duterte said in comments his office released on Saturday. “He understood the way we are handling it ... I supposed that what he really wanted to say was that we would be the last to interfere in the affairs of your own country.” He added: “We are doing it as a sovereign nation, the right way. And he wishes us well. And I said that, well, we assured him of our ties with America.” His special adviser, Christopher Go, had earlier said in a text message to media that Trump had invited Duterte to visit the White House next year. There appeared to be confusion, however. Duterte mentioned an invite to Washington and New York, and that Trump asked him to notify him of his presence “if I’m around”. A statement issued by Trump’s transition team made no mention of that. It said the two men “noted the long history of friendship” between their countries and would work closely on “matters of shared interest and concern”. Duterte made waves when he visited China in October and announced his “separation” from the United States.  In five months in office, he has upended Philippine foreign policy by berating the United States, pursuing a new alliance with Russia and also China, with which Manila has a history of bitter disputes. His diplomacy has created jitters among Asian nations concerned about Beijing’s influence and Washington’s regional staying power. Duterte told Democrat Obama to “go to hell” and called him a “son of a bitch” whom he would humiliate if he visited the Philippines. Despite his optimism about Trump’s win, it has not stopped Duterte railing against what he calls a U.S. history of “hypocrisy” and “bullying” worldwide. Republican Trump told Reuters during his campaign that Duterte’s comments about Obama had showed “a lack of respect for our country.” But he also stressed the “very important strategic location” of the Philippines. A source who has advised Trump’s transition team on security policy said the president-elect would start a “clean slate” with Duterte. “He is perfectly capable of talking to Duterte in an open way without being wedded to previous policy failures,” the source said of Trump. Sometimes called the ‘Trump of the East’ because of his brash, mercurial style, Duterte has threatened repeatedly to scrap U.S. defense ties, saying he “hates” having foreign soldiers in the Philippines. Joint military exercises look set to be downsized as Duterte demanded and uncertainty surrounds the 2014 Enhanced Defence Cooperation Agreement (EDCA), a deal of strategic importance because it allows U.S. access to Philippine bases on a troop rotation basis. “EDCA is a concern and some of the things Duterte has said are a concern,” said the advisor to Trump’s team. “That is not going to change based on who the president is.” Some experts say Duterte’s appointment of special envoys to Washington suggest he aims to keep good ties. Among those is real estate tycoon Jose Antonio, who bought the rights to name a new commercial project in Manila “Trump Towers”. Ernest Bower of the Bower Group Asia consultancy said it was likely the call was set up by Trump’s Philippine business partners and a core group of advisers, including his children. Bower said Trump’s win could offer Duterte a face-saving way to step back from his anti-U.S. stance, while Duterte offers Trump a chance to stress the importance of Asian alliances. Duterte said it would be “great for our country” if Trump visited Manila next year when it chairs the Association of South East Asian Nations and summits of Asian leaders, and Trump wanted to attend. Bower said that may have been fortuitous for Trump. “My guess is he was more interested in making a point - that he could deal with Duterte in ways Obama couldn’t - than in the strategic wisdom of driving alignment with the ASEAN chair.”","subject":"politicsNews","date":"December 2, 2016 ","label":1},"truncated_cells":[]},{"row_idx":78,"row":{"Unnamed: 0":10873,"title":"Trump shows his presidential bid is no mere publicity stunt","text":"Donald Trump served notice on Tuesday to those who have refused to take his 2016 White House campaign seriously: The celebrity real-estate developer and former reality show host is no joke.  While Trump had been expected to win New Hampshire’s nominating contest, he swamped the Republican field by almost 20 points, demonstrating that his passionate, anti-establishment supporters could be relied on to show up and vote when it counts. “It’s a monumental win for Donald Trump,” said Michael Dennehy, a Republican strategist in Concord, New Hampshire, who is unaffiliated with any campaign. “The message is being sent loud and clear that Republicans want to throw Washington on its head.” Trump still has a long road ahead. He suffers from high unfavorability ratings and is often an undisciplined candidate who invites controversy with his policies and insults, going so far this week as to repeat an audience member’s assertion that U.S. Senator Ted Cruz was a “pussy.” Yet after finishing second in the Iowa caucuses last week and now first in New Hampshire, Trump can take solace in the fact that rarely is the ultimate nominee from either party not one of the top two finishers in Iowa or New Hampshire.  Since Iowa began holding the first-in-the-nation caucus in 1976, no Republican has finished second there and first in New Hampshire and failed to win the nomination. The two states are the first of the state-by-state nominating contests for the Nov. 8 election to succeed Democratic President Barack Obama. In New Hampshire, Trump, at least for the moment, put to rest questions over whether his strong showing in polls was illusory, after he underperformed them last week in Iowa. His immediate prospects were further helped by the failure of any of the establishment candidates to emerge as a clear challenger. Taken together, the mainstream candidates pulled in enough votes to overcome Trump. But no single one came close to him and there are few signs of a major consolidation anytime soon.  “The victory by Trump here has the makings of a major disaster for the establishment,” said Ford O’Connell, a Republican strategist.  The candidate who had been widely viewed as Trump’s biggest threat, U.S. Senator Marco Rubio of Florida, suffered deep wounds in New Hampshire after a strong showing in Iowa that some pundits believed would propel him to the top ranks of the establishment Republicans. After stumbling badly in a debate on Saturday, the man who had been considered by many in the party as its best hope to retake the White House finished deep in the middle of the pack.  “Rubio’s disastrous showing shifted the landscape of the entire campaign,” Dennehy said. He added he had conversations with many undecided voters in recent days who liked Rubio but changed their support to other candidates after the debate.  The Republican nomination race now bends southward, with a primary in South Carolina on Feb. 20 the next test. Trump has held a double-digit lead there for months. After South Carolina comes Nevada, and then a spate of Southern states on March 1. All provide Trump with the chance to consolidate his support before any other candidate amasses enough delegates to pose a real threat. His toughest opponent in those states will likely be Cruz, the Texas lawmaker who won in Iowa and whose insurgent candidacy is equally worrisome to the Republican establishment.  But Trump appeared in New Hampshire to learn from some of the mistakes his campaign made in Iowa. In recent days, he combined the large-scale rallies for which he has become known with more intimate affairs, an apparent effort to address criticism he was not devoting enough focus to retail campaigning.  Trump also returned to the populist themes that have characterized his campaign and made him an atypical front-runner for the Republican nomination. He ripped U.S. corporations for sending jobs overseas and repeatedly slammed the pharmaceutical industry for charging high prices on prescription drugs and the health insurance industry for consistently hiking rates.  His campaign showed more of an ability to reach voters who may not have otherwise engaged in the political process. Typical were Marjorie Callicutt, 64, and her husband, Fred, 74, who attended a Trump event in tiny Plymouth, New Hampshire, on Sunday. The couple said they would not have been there if the Trump campaign had not called them the day before to tell them about the rally. Both said they had been persuaded to vote for him. “He woke up the country,” Fred Callicutt said. “He says things that nobody wants to talk about.”  (Reporting by James Oliphant; Additional reporting by Ginger Gibson in Washington; Editing by Peter Cooney) SAP is the sponsor of this content. It was independently created by Reuters’ editorial staff and funded in part by SAP, which otherwise has no role in this coverage.","subject":"politicsNews","date":"February 10, 2016 ","label":1},"truncated_cells":[]},{"row_idx":79,"row":{"Unnamed: 0":21297,"title":"EMBARRASSING: Obama Explains How He Will ‘Rebuke’ ISIS By Attending Climate Change Summit [VIDEO]","text":"re buke r byo ok/ verb 1. express sharp disapproval or criticism of (someone) because of their behavior or actions.Obama s sharp disapproval of ISIS will have them shaking in their evil boots Very powerful!By now, most of America would rather have a hot poker in the eye than be forced to hear the sound of Barry s incompetent voice, but you just have to listen to this arrogant a*s to believe he actually said this re buke r byo ok/ verb 1. express sharp disapproval or criticism of (someone) because of their behavior or actions.In a joint press conference with France s President Hollande on Tuesday, President Obama took a cue from Brian Williams and focused on the  powerful  message that  we  are sending terrorists by not cancelling the climate conference in Paris.Imagine the cold chill wind that in that moment crawled up the spine of every ISIS terrorist with a TV and possibly an aerosol spray can. Like Reagan and Churchill before him, the President has spoken words that will echo through the ages.  We will fight them on the beaches, which we re preserving though a combination of initiatives such as emissions reduction and carbon offsets.  Stirring.One should keep in mind, this is the same climate conference which is featuring Prince Charles as a keynote speaker. Yes, Prince Charles, who says the conflict in Syria is the fault of climate change.So .. we ll be rebuking terror by focusing on the  real  threat of climate change and featuring a speaker who blames the battle with ISIS on the weather rather than the terror.Rebuke. I do not think it means what you think it means.Via: Truth Revolt","subject":"left-news","date":"Nov 25, 2015","label":0},"truncated_cells":[]},{"row_idx":80,"row":{"Unnamed: 0":22799,"title":"Boiler Room EP #124 – Weather Warfare & CNN Goblin Pits","text":"Tune in to the Alternate Current Radio Network (ACR) for another LIVE broadcast of  The Boiler Room tonight 6:00 PM PST | 8:00 PM CST | 9:00 PM EST for this special broadcast. Join us for uncensored, uninterruptible talk radio, custom-made for bar fly philosophers, misguided moralists, masochists, street corner evangelists, media-maniacs, savants, political animals and otherwise lovable rascals.Join ACR hosts Hesher and Spore along side Jay Dyer of Jay s Analysis and Andy Nowicki the Nameless One, for the hundred and twenty fourth episode of BOILER ROOM. Turn it up, tune in and hang with the ACR Brain-Trust for this weeks boil downs and analysis and the usual gnashing of the teeth of the political animals in the social reject club.This week on the show the ACR Brain-Trust is back with another meeting of the Social Reject Club in the No Friends Left Zone and the gang is discussing the ongoing aftermath of the Charlottesville protests, Hurricane Harvey, weather warfare, geoengineering, movies, CNN faking flood rescues and more.Direct Download Episode #124Please like and share the program and visit our donate page to get involved! Reference Links, for your consideration and research:","subject":"Middle-east","date":"September 1, 2017","label":0},"truncated_cells":[]},{"row_idx":81,"row":{"Unnamed: 0":1061,"title":"Illinois governor enlists counterparts to attack Democrats in election ad","text":"Illinois’ Republican governor has launched an unusual attack ad in his re-election campaign that features three neighboring governors crediting their states’ job gains to Illinois taxes crafted by a state House Democratic leader. Illinois Republican Governor Bruce Rauner, who kicked off his 2018 re-election campaign this week, saw his first term marred by a political impasse that left Illinois without a budget for two years before lawmakers overrode his veto this summer to raise taxes.     Governors in the new ad include Missouri’s Eric Greitens, Wisconsin’s Scott Walker and Indiana’s Eric Holcomb - all Republicans like Rauner - thanking Rauner’s political foil, Illinois House Speaker Michael Madigan, for blocking reforms, raising taxes and sending jobs to their states. “Hoosiers love you, Mike Madigan,” Holcomb said in the ad. Among the Democrats whom Rauner, a wealthy businessman, could face after a March primary are J.B. Pritzker, an heir to the Hyatt Hotels Corp fortune, and Chris Kennedy, son of the late U.S. Senator Robert Kennedy.        The governor’s race in the fifth-largest state is expected to rank among the most expensive in the country. Experts who follow elections said the ad was unusual. “This is creative since it uses GOP governors from surrounding states to shift the blame for Illinois’ woes from Rauner to a Democratic leader,” University of Virginia political science professor Larry Sabato said.  “Voters usually hold their governor responsible for the state of the state,” he added.  While it is not unusual for governors to make appearances for other campaigns, they tend to take a more positive approach, highlighting an incumbent’s achievements, said Dick Simpson, a political science professor at the University of Illinois at Chicago.     While the ad may resonate with rural, conservative voters, it also comes as Illinois and other states seek to attract Amazon.com’s $5 billion second headquarters. Simpson said highlighting how Illinois policies hurt the state is “probably not helpful.”     Madigan dismissed the ad in a statement, calling it a “race to the bottom being led by his role models from states where middle-class wages are a fraction of what they are in Illinois.”     Rauner has feuded with Democrats, who control the state legislature, over his insistence a state budget be tied to policy demands that would weaken unions, impose legislative term limits and freeze property taxes.     He also has angered conservatives by signing a bill to expand state-funded coverage of abortions. Political scientists said he faces a tough re-election bid in a state often carried by the Democratic candidate in presidential elections. Spending on the race could top $150 million, a rarity, said Sarah Brune, executive director of the Illinois Campaign for Political Reform.","subject":"politicsNews","date":"October 24, 2017 ","label":1},"truncated_cells":[]},{"row_idx":82,"row":{"Unnamed: 0":2990,"title":"House overwhelmingly backs NATO mutual defense","text":"The U.S. House of Representatives voted nearly unanimously on Tuesday to reaffirm the NATO alliance’s guarantee that all members defend each other, weeks after President Donald Trump raised doubts about Washington’s support for the agreement. The vote was 423-4 in the House, where Trump’s fellow Republicans hold a 48-seat majority, for a resolution “solemnly reaffirming” the U.S. commitment to Article 5 of the North Atlantic Treaty. It also supports calls for every NATO member to spend at least 2 percent of its gross domestic product on defense by 2024.  During a visit to NATO headquarters in Brussels in May that was part of his first overseas trip, Trump pointedly did not mention U.S. support for that critical portion of the NATO charter, rattling allies. Instead, he used a speech there to demand that member states pay more for the alliance’s defense. Trump later said he backed the mutual defense agreement, and other senior officials rushed to express U.S. support. “With all the threats we and our partners face around the globe, a strong and secure NATO is more important than ever before,” Republican House Speaker Paul Ryan said in a statement. The resolution was co-sponsored by Ryan and House Democratic Leader Nancy Pelosi, as well as the number two Republican and Democrat in the chamber, and the Republican chairman and the ranking Democrat on the House Foreign Affairs Committee.","subject":"politicsNews","date":"June 27, 2017 ","label":1},"truncated_cells":[]},{"row_idx":83,"row":{"Unnamed: 0":6348,"title":"Trump blames 'both Democrats and Republicans' for allegations","text":"U.S. President-elect Donald Trump on Friday accused his political opponents, “both Democrats and Republicans,” for putting together a dossier of unverified claims linking him to Russia and said the document was probably released by intelligence agencies. “Totally made up facts by sleazebag political operatives, both Democrats and Republicans - FAKE NEWS! Russia says nothing exists,” Trump said in a series of posts on Twitter. “Probably released by ‘Intelligence’ even knowing there is no proof, and never will be,” he said. On Wednesday, U.S. spy chief James Clapper said that media leaks of the material had not come from U.S. intelligence agencies and that the agencies had not judged whether the information was reliable.","subject":"politicsNews","date":"January 13, 2017 ","label":1},"truncated_cells":[]},{"row_idx":84,"row":{"Unnamed: 0":19441,"title":"SHERIFF ARPAIO Bombshell: Obama’s Birth Certificate Is A FAKE…Turning Over Evidence To Feds [VIDEO]","text":"Maricopa County Sheriff Joe Arpaio says a new video analysis shows that parts of Obama s birth certificate were copied from another certificate. After arguing his point for five years, Arpaio says he will turn this new evidence over to the fed.  USA TODAYAt 4 p.m. sharp, Arpaio and a member of his Sheriff s Office s Cold Case Posse had a big message for the 40-odd journalists in attendance: You were wrong.Arpaio and his aides announced that a five-year investigation had  proved  that Obama s birth certificate from Hawaii in 1961 was a fake. An accompanying presentation highlighted what they called  9 points of forgery  on the document, which focused on the angles of date stamps, typed letters and words.  USA TodayREMEMBER THE WOMAN WHO VERIFIED OBAMA S Birth Certificate that was killed in a plane crash after she verified the  authenticity  of his birth certificate?The Hawaiian health official who verified the authenticity of President Obama s birth certificate died in a small plane crash.The plane, carrying a pilot and eight passengers, went down Wednesday in the water a half mile off the Hawaiian island of Molokai, the Maui Fire Department said. The lone fatality was Loretta Fuddy, who has served as state health director since January 2011. Tom Matsuda, the interim executive director of Hawaii s health insurance exchange, confirmed Fuddy s death.Fuddy, 65, made national news in April 2011 when she verified the authenticity of certified copies of President Obama s birth certificate. Obama had requested the release to curb claims by so-called  birthers  that he was born in Kenya and not eligible to be president.Makani Kai Air President Richard Schuman told Honolulu-based KITV that he spoke with the pilot of the single-engine turboprop Cessna Grand Caravan after the crash. What he reported is after takeoff   there was catastrophic engine failure,  Schuman said.  He did the best he can to bring the aircraft down safely and he got everybody out of the aircraft. Schuman said the cause of the engine failure had not yet been determined. The National Transportation Safety Board was investigating the crash; NTSB spokesman Eric Weiss said that based on the location of the crash it was unlikely the plane will be recovered.  USA TODAYArpaio promised to provide an update and a  final conclusion  to the Barack Obama Birth Certificate investigation.The Maricopa County Sheriff s Office announced they believe President Obama s longform birth certificate was forged.They cite nine points of forgery, claiming the Obama document contains stamp prints digitally lifted from a certificate belonging to a person named Johanna Ah nee.  Breaking 911Chief Investigator Mike Zullo said,  Forensic analysis showing the characters on the document were pieced together from secondary sources.  [..]  Words, letters and hand placed date stamps have been digitally copied from Ah Nee s birth certificate and pasted onto Obama s longform birth certificate  [..]  We re pretty confident with these results.   Breaking 911","subject":"left-news","date":"Dec 16, 2016","label":0},"truncated_cells":[]},{"row_idx":85,"row":{"Unnamed: 0":20549,"title":"FURIOUS CUSTOMERS RESPOND To Home Depot Cashier’s “AMERICA WAS NEVER GREAT” Anti-Trump Hat [VIDEO]","text":"The people who are angry about her wearing this hat should also be angry at the  hate America  indoctrination our children are getting at school, and from our Community Organizer In Chief who s made it cool to hate America and it s racist, homophobic, greedy citizens The decision by Home Depot cashier to wear a white baseball cap carrying the slogan  America Was Never Great  has caused a social media storm.A photo of Staten Island Home Depot employee Krystal Lake wearing the anti-Trump hat went viral Sunday. The reaction from Facebook and Twitter users skewed negative, with some promising to never shop at Home Depot again.According to this black @HomeDepot employee, \"America was never great\" pic.twitter.com/AO9p39TJCk  Dr. White (@RealDoctorWhite) May 18, 2016Hey @HomeDepot you are OK with this?  What an insult to #Vets and ALL Americans #Vets4Trump #Trump2016 pic.twitter.com/BjM835m4rH  District fCriminals (@DistOfCriminals) May 18, 2016To be sure, Lake, 22, admits that wearing the  America Was Never Great  hat was her way of making a broader statement about U.S. history. The point of the hat was to say America needs changing and improvement,  Lake told the Staten Island Advance.  I don t think it s a positive message to say,  Let s look to the past. The lifelong New Yorker said she was surprised when she awoke Wednesday morning to see a tsunami of calls and texts messages from friends and co-workers asking if she had noticed the firestorm her hat had created. Everyone kept asking me if I was on Facebook or Twitter, which I hadn t been,  she said,  and then I saw how many people were sharing [the picture] and that it was going viral. I was honestly shocked   I didn t expect any of this to happen,  Lake added.Interestingly, Republican presidential candidate and New York real estate mogul Donald Trump won the April 19 primary contest in a landslide, securing over 80% support in Staten Island.For its part, Home Depot didn t waste time responding to critics on Twitter and Facebook. The Atlanta Georgia-based home improvement retailer called Lake s hat inappropriate.It is against Home Depot policy for employees to wear apparel that reflects political statements, company spokesman Stephen Holmes said.Via: Breitbart News","subject":"left-news","date":"May 20, 2016","label":0},"truncated_cells":[]},{"row_idx":86,"row":{"Unnamed: 0":21402,"title":"UN Celebrates Its 70th Anniversary With Communist Statue In NYC Park","text":"In case you hadn t heard, Obama signed a new UN development plan to make America a socialist nation by 2030. Yes, it s true and the UN is celebrating by unveiling a statue celebrating our  global citizenship .  Here are a few of the important points in the plan that spell out the  shared responsibility  with the globe and then information below about the statue in NYC: Communists say that Socialism is the stepping stone to Communism, and the UN 2030 Sustainable Development agenda won t fail to disappoint them. Socialism hinges on several economic factors which coincide with sustainable development goals. They are universal healthcare, universal education, universal employment, and wealth redistribution. All of these are outlined clearly in the UN agreement.For example on the subject of universal healthcare, on page 6, section 26 of  Transforming our World: The 2030 Agenda for Sustainable Development  in the section titled  The New Agenda  it states:26. To promote physical and mental health and well-being, and to extend life expectancy for all, we must achieve universal health coverage and access to quality health care. No one must be left behind. We commit to accelerating the progress made to date in reducing newborn, child and maternal mortality by ending all such preventable deaths before 2030. We are committed to ensuring universal access to sexual and reproductive health-care services, including for family planning, information and education.This goal is also repeated as Sustainable Development Goal #3, page 14, section 3.8:3.8 Achieve universal health coverage, including financial risk protection, access to quality essential health-care services and access to safe, effective, quality and affordable essential medicines and vaccines for all.As it pertains to wealth redistribution and universal employment the proof is found on page 7, section 27:27. We will seek to build strong economic foundations for all our countries. Sustained, inclusive and sustainable economic growth is essential for prosperity. This will only be possible if wealth is shared and income inequality is addressed. We will work to build dynamic, sustainable, innovative and people-centred economies, promoting youth employment and women s economic empowerment, in particular, and decent work for all.Universal employment is also mentioned on page 12 as Sustainable Development Goal #8:Goal 8. Promote sustained, inclusive and sustainable economic growth, full and productive employment and decent work for all.The last time I read the words  shared responsibility  it was when I discovered that the Obamacare fine imposed by the IRS for failing to have health insurance was called the Individual Shared Responsibility Payment. While I thought this had to be a veiled reference to some Marxist dictator s quote, it now appears that it has more to do with the Progressive globalization movement.This weekend the United Nations is set to celebrate its 70th anniversary. As apart of those celebrations the U.N. will unveil a new work of art in New York City titled Enlightened Universe. The U.N. claims this new sculpture is all about Global Citizenship and Shared Responsibility: In celebration of the seventieth anniversary of the United Nations, a monumental art installation entitled Enlightened Universe will be unveiled on Saturday, 24 October, at 4:30 p.m. at the Rumsey Playfield in Central Park. The installation   created by Spanish artist Crist bal Gabarr n   is presented by The Gabarron Foundation in partnership with the United Nations.The commemorative work of art depicts 70 life-size figures joined in hand around a central globe, creating a human chain of global citizenship, respect for nature and shared responsibility. The sphere measures 6,371 millimetres in diameter to correspond to the Earth s average radius of 6,371 kilometres. The 70 figures represent the 70 years of the United Nations. Rumsey Playfield, where the sculpture is to be erected, is an area of the Central Park where concerts and other events are held.Considering that the new United Nations Sustainable Development Plan calls for the United States to become a Socialist nation by 2030, it s not surprising that Obamacare, which was designed to push the U.S. towards government run healthcare, and the United Nations, would  share  the same collectivist, albeit Marxist, vocabulary.Via: Progressives Today","subject":"left-news","date":"Oct 21, 2015","label":0},"truncated_cells":[]},{"row_idx":87,"row":{"Unnamed: 0":11546,"title":"PRESIDENT TRUMP: Nancy Pelosi Is Helping To Eliminate Democrat Party…”I think she’s incompetent” [VIDEO]","text":"In a sit-down interview with Fox and Friends, Brian Kilmeade asked President Trump what he thought of Nancy Pelosi s comments yesterday on the cusp of his first major speech tonight. Kilmeade told Trump that Pelosi said,  Basically he s done nothing.   President Trump responded,  Well I ve been watching Nancy s statements and I think she s incompetent actually, you know, if you look at what s going on with uh, the Democrats and the party, it s getting smaller and smaller. We re soon going to have a one-party system. I actually think a two-party system is healthy and good. She s done a terrible job and I don t think she s a good spokesman. \"I think she's incompetent, actually, you know, if you look at what's going on with the Democrats and the party.\"  @POTUS on Nancy Pelosi pic.twitter.com/AtLD3Enayk  FOX & friends (@foxandfriends) February 28, 2017","subject":"politics","date":"Feb 28, 2017","label":0},"truncated_cells":[]},{"row_idx":88,"row":{"Unnamed: 0":17006,"title":"OBAMA’S DOJ: Lois Lerner Won’t Face Charges In Targeting Scandal","text":"Well this is no surprise but it s still wrong. Targeting conservative Americans or ANY American should be a crime.Lois Lerner will not face criminal charges for targeting conservative and Tea Party groups during her time at the Internal Revenue Service, the Department of Justice said Friday.CNN reported that the Justice Department will not bring charges against Lerner, who served as the director of exempt organizations at the IRS, and will close its two-year investigation into the alleged improper targeting.The government agency said in a letter to Congress that investigators found  substantial evidence of mismanagement, poor judgment, and institutional inertia leading to the belief by many tax-exempt applicants that the IRS targeted them based on their political viewpoints.  Read more: WFB","subject":"Government News","date":"Oct 24, 2015","label":0},"truncated_cells":[]},{"row_idx":89,"row":{"Unnamed: 0":2675,"title":"Fact: Repealing Obamacare Will Absolutely Decimate Red State America","text":"We hear a lot from Republicans about how they re going to repeal the  job killing,   healthcare killing,  big government law unofficially called Obamacare. These unsung heroes of the nation, almost all of them representing red state America, are going to free us and their states from the shackles of socialized medicine   or so they say.Should Republicans get their way, they will absolutely decimate their states  economies.According to the Economic Policy Institute, an American think tank in Washington, D.C.:Across the country, 29.8 million people would lose their health insurance if the Affordable Care Act were repealed more than doubling the number of people without health insurance. And 1.2 million jobs would be lost not just in health care but across the board.So not only will America overall be taken back to the dark ages of pre-Obamacare, red states will be hit the hardest. In terms of the increase in the uninsured rate per state, of the top 30 that will be hit hardest, 20 are red states that voted for Donald Trump.So how much will the uninsured rate increase with an Obamacare repeal? Here s the list (top 20) for Trump states:The blue states that would be most affected by the repeal would be Massachusetts, New Hampshire, Illinois, Oregon, and Washington.If Republicans think their town hall events are bad now, just wait until they see what the summer of 2017 will produce. Democrats got the brunt of it in 2011, now it s time for the GOP to reap what they ve sown.Leaked audio from the Republican retreat in Philadelphia showed that many GOPers were divided on whether to repeal or reform Obamacare. Many expressed concern with how their constituents would react if a full repeal were put in place. At the retreat, one Republican, Tom MacArthur of New Jersey, yelled: We re telling those people that we re not going to pull the rug out from under them, and if we do this too fast, we are in fact going to pull the rug out from under them. Rep. Virginia Foxx chastised MacArthur and other weary Republicans as  weak-kneed. Rep. MacArthur is correct in his fears: If Obamacare is repealed, and people lose their health insurance, Republicans are going to be cast as the enemy for pulling the rug out. And as the Economic Policy Institute showed, there are a lot of red-state Americans who will be affected.Given Trump s immense unpopularity, an Obamacare repeal would almost certainly hand the Democrats a House and Senate majority in 2018.Featured image by Chip Somodevilla via Getty Images","subject":"News","date":"February 5, 2017","label":0},"truncated_cells":[]},{"row_idx":90,"row":{"Unnamed: 0":2447,"title":"Democratic leader urges U.S. House to move on Obamacare fixes","text":"U.S. House of Representatives Democratic leader Nancy Pelosi urged Republicans to establish a process to move forward on improvements to Obamacare on Friday after their healthcare reform effort failed in the Senate. “We call upon the speaker to establish a process - we can go right to the committees - and have the discussion on how we keep America healthy,” Pelosi said at a news conference at which Democrats called for a bipartisan effort on healthcare reform.","subject":"politicsNews","date":"July 28, 2017 ","label":1},"truncated_cells":[]},{"row_idx":91,"row":{"Unnamed: 0":698,"title":"Republican U.S. Senators Rubio, Lee want boost to child tax credit","text":"Republican U.S. Senators Marco Rubio and Mike Lee said they want a child tax credit to increase to $2,000 in a Senate tax bill unveiled on Thursday. “While we are glad to see an increase to the child tax credit, like the House bill, it is simply not enough for working families,” Rubio and Lee said in a joint statement. The Senate bill would raise the child tax credit to $1,650 from $1,000 currently.","subject":"politicsNews","date":"November 9, 2017 ","label":1},"truncated_cells":[]},{"row_idx":92,"row":{"Unnamed: 0":18296,"title":"Austria puts the squeeze on refugees with benefit cuts","text":"Ahmed Ali, a 34-year-old teacher, fled the war in Syria two years ago and settled in a quiet Austrian town on the hilly border with the Czech Republic. He was hoping to raise a family there. But voter attitudes towards immigrants have hardened due to concerns about security and the economy after Austria took in more than 1 percent of its population in asylum seekers in 2015.  This fueled support for the far-right party Freedom Party and its candidate came close to winning last year s presidential election. Immigration is still the dominant political issue ahead of the Oct. 15 parliamentary election. In January, lawmakers in Lower Austria, where Ali lived, reduced benefits for new arrivals. They said the benefits system needed protecting from being overstretched by the influx of refugees.  Ali and his pregnant wife moved again to Vienna in July, where their benefits would still be paid in full.  Most of us fled when the letter came telling us our social benefits would be cut. At first we didn t believe it but then we saw it on our bank balance,  said Ali, who says his German is not yet good enough to find work. Three of Austria s nine provinces   Lower Austria, Burgenland and Upper Austria   have reduced benefits for new arrivals. Foreign Minister Sebastian Kurz, leader of the conservative People s Party which is leading in the polls, wants to make similar cuts apply to the whole country.  Chancellor Christian Kern, whose Social Democratic Party polls show competing with the Freedom Party for second place, has resisted the idea but said he could support them in cases where new arrivals turn down job offers.    So far, the cuts have primarily impacted migrants like Ali who sought asylum in Austria when it opened its border in 2015 although some Austrians returning home have also been caught. In Burgenland the rules apply to all people seeking help who have spent fewer than five years of the six preceding their application for benefits in Austria.  A statement accompanying the Upper Austrian bill painted the cuts as a way to tackle the problem of  welfare magnetism  in the context of refugees. The Lower Austrian government declined to comment due to a legal challenge against the cuts.  In a case brought by a charity, Austria s Constitutional Court is expected to rule next year on whether the cuts by Lower Austria, decided in late 2016 and implemented since early 2017, are illegal.  The 1951 United Nations Refugee Convention says host countries must grant refugees  the same treatment with respect to public relief and assistance  as their own nationals. A 2011 EU directive sets a similar rule.  The U.N. refugee agency (UNHCR), which has denounced  xenophobic debates  in Austrian politics ahead of the election,  has described the cuts as breaches of international and European law but no international cases have been started.   A Burgenland spokeswoman defended the benefits changes, saying they targeted Austrian nationals as well.    Therefore there is no violation of ... the EU directive and the refugee convention,  she said.  A spokesman for Kurz said legislation to expand the cuts would be passed and phrased in such a way  that no doubt for the highest courts will emerge . The three provinces have cut benefits for new arrivals, even after obtaining asylum, to around 570 euros ($669) a month, less than half the poverty threshold of 1,200 euros, compared with around 850 euros for an Austrian who has never lived abroad. Benefits for a household have been capped at 1,500 euros.  Rather than live off less than what is considered the bare minimum for most Austrians, many of those affected have moved, particularly to the capital. Ali moved to an apartment with his uncle and aunt in a dilapidated building on the outskirts of the city costing 1,100 euros a month.  They don t care how many children you have. And maybe they ll cut again,  Ali said in his living room with two sofas, a television set and a picture of Kurdish leader Masoud Barzani.  He found more affordable apartments but the landlord did not want refugees as tenants. One landlady was concerned social benefits for refugees might be cut in Vienna, too.   Instead of cutting the social safety net, integration and independence should be supported. We fear that language learning, training and the search for work will suffer if those affected don t know how to pay their rent anymore,  said the chief the UNHCR s Austria office, Christoph Pinter.   Although the Freedom Party and Kurz s conservatives have been the most vocal about cutting benefits for new arrivals, the three provinces that have put cuts in place are governed by various two-way combinations of all three main political parties. But most of those affected who spoke to Reuters fear an election victory for Kurz.  If Kurz wins, it will be a big problem,  said 24-year-old Basel from Deraa in Syria. He moved from Lower Austria to Vienna in July, leaving behind friends and a job as a hairdresser.  He says the cuts paralyze people like him with fear.   You stop thinking about the future.   (For a graphic on Austria's parliamentary election, click tmsnrt.rs/2hKIi65)","subject":"worldnews","date":"October 4, 2017 ","label":1},"truncated_cells":[]},{"row_idx":93,"row":{"Unnamed: 0":1276,"title":"Texas Super-Dolt Louie Gohmert SAVAGED For Licking Trump’s Boots Over London Response (TWEETS)","text":"Trump is lighting the Internet on fire with his response to the London attack, and not in a good way. But, true to form, some Republicans are busy washing Trump s boots with their tongues over what he said about London, and people aren t liking that, either. Texas  dumbest lawmaker, Louie Gohmert, appeared on Fox News to fawn over Trump s response to London, and later tweeted how happy he is that Trump understands the seriousness of the problem and isn t distracted by people trying to be politically correct.Gohmert displayed his own sorry ignorance of the issues when he blasted liberals over our calls for better and more sensible gun regulations following mass shootings, saying that we re hypocrites because we won t call for bans on white vans and knives after the London attack. He also blasted the judges who have blocked Trump s Muslim ban due to the fact that it s obviously racist and will do nothing to stop terrorism here. He sides with Trump on the idea that we need the Muslim ban and that the courts have no right to block it (because Trump, as president, can do whatever he wants).But he had to top his bootlicking off with this bit of blind devotion:Thank God @POTUS understands seriousness of this issue & isn t distracted by ppl screaming abt political correctness https://t.co/KDPoI4fdLy  Louie Gohmert (@replouiegohmert) June 4, 2017He wasn t going to get away with that. As Twitter is wont to do, they piled on him and his ignorance of Trump s complete lack of understanding of anything, as well as for refusing to censure the biggest exporter of Islamic terrorism there is.Our embarrassing buffoon of a @POTUS literally is the one screaming about  political correctness,  you quarter-wit!  Betty Cracker (@bettycrackerfl) June 4, 2017As a Texan and American, wondering how one can credibly stand *against* terrorism while holding hands *with* Saudi Arabia?  SMD (@seanmfdineen) June 4, 2017Yes. We liberals were just laughing the attack off, you simpleton dolt.  Crutnacker (@Crutnacker) June 4, 2017Quite the contrary, dt has NO CLUE on how to respond approximately. The fake and clueless prez. Sad  Ren Ram (@MarcProust) June 4, 2017Political correctness doesn t cause terror. Interventionist policies + radical Wahhabism from Saudis and rest of Gulf do.  FVR (@fightingvoice) June 4, 2017And also why all the golf?  SMD (@seanmfdineen) June 4, 2017He had a 30-day plan to defeat ISIS. When is the parade, you inbred plastic shoehorn?  Witchfinder General (@Pedro_Loves_U) June 4, 2017Oh we understand Louie, @GOP wins by fear mongering and you are major Texass.  Tom Richards (@4politics2) June 4, 2017 Our Potus is only distracted by his own vices. You ought to be thrown out of office What has happened to Texans that they would elect you.  JACarver (@YancyCt) June 4, 2017Crawl back under your rock Louie.  Paul Henry (@paulndor) June 4, 2017You are an idiot  jlockett (@JLickett) June 4, 2017You are a human fart.  TH (@THVotes) June 4, 2017Glad he takes this serious enough to take in 2 full days of golfing. Meanwhile no head of FEMA or FBI director to replace one he fired  jimmi phoenix (@Phillies_chants) June 4, 2017Yep. How Gohmert got elected at all is a mystery. Having his head so far up Trump s ass is just the latest in his long, sad string of completely moronic moves. But what can we expect from someone who can t see the forest for the trees and refuses to even try?Featured image by Mark Wilson via Getty Images","subject":"News","date":"June 4, 2017","label":0},"truncated_cells":[]},{"row_idx":94,"row":{"Unnamed: 0":2913,"title":"Trump Press Sec. Claims Inaugural Numbers Were Biggest EVER – Gets RIPPED APART (VIDEO)","text":"Trump s press secretary, Sean Spicer, has wasted no time in letting the media know that reporting anything making Trump look less-than totally awesome will not be tolerated. He took to the White House press room earlier today to scold the press for daring to compare Trump s inaugural numbers to Obama s, when clearly, Trump s numbers were the biggest in history.Yes, he said that. If you re laughing too hard to continue reading at the moment, believe us, we understand fully. Transcribing Spicer s comments was unusually difficult for that very reason.It s just beyond absurd: This was the largest audience to ever witness an inauguration PERIOD, both in person and around the globe. Even The New York Times printed a photograph showing a misrepresentation of the crowd in the original tweet in their paper, which showed the full extent of the support depth and crowd and inse that existed. These attempts to lessen the enthusiasm of the inauguration are shameful and wrong. What. Just what? The biggest audience to witness an inauguration ever? Of course, Twitter beat him up for this:@seanspicer if your goal is to become a bigger liar than your boss the #Appresident, #chumptytrumpty, you re well on your way.  Stephanie Greenblatt (@StephUGreenb) January 22, 2017How long before Sean Spicer starts babbling incoherently at a press conference?  Thomas Reich (@gollum1419_g) January 22, 2017Hey @seanspicer I figured out who your boss reminds me of: Lord Farquaad with his yuge obsession with size. pic.twitter.com/09xtTjXW2e  Justin Bell (@jabellpepper) January 22, 2017@NYDailyNews factchecks Sean Spicer s clownery. #spicerbriefing #womensmarch https://t.co/frHfHk3Eyn  Gus Bova (@bova_gus) January 22, 2017@seanspicer We know about the deaf & mute bit but now see you re also blind. Congratulation & good luck to spouting Trump s world of LIE s https://t.co/WHXlUQ8ec2  Junji Tatsuno (@jtatsuno) January 22, 2017@FoxNews @seanspicer I can smell your insecurity all the way over here on the west coast, bro.  PDXSEAPEKSFOCHIyep (@PDXSEAPEKSFOCHI) January 22, 2017Let me correct your headline, @npr : Sean Spicer Lied https://t.co/YBhOvjBShU  Kimberly Coleman (@TarpsTwin) January 22, 2017Does he not realize we could see the pictures and the tv footage? Does he not know we all have tvs and the Internet?@POTUS @seanspicer https://t.co/P0cDsN4AEW  Ithinkitscatchy (@Ithinkitscatchy) January 22, 2017@seanspicer how s it feel to be sowing fascist propaganda? You re a fool, a chump, and in no way a patriot. Shame on you. @realDonaldTrump  Lily Turner (@LTurner01) January 22, 2017 Sean Spicer  said it was the largest inauguration turnout. He meant  inauguration protest  turnout.  Chuck Nigash (@lightfallstudio) January 22, 2017@markberman @BadASSSery @seanspicer Spicer, you re a LIAR. No integrity. No morals. No ethics. Just a plain old liar in a bad suit.  Nikki (@nikkikl) January 22, 2017@seanspicer Day 1 & you just lost all credibility with Americans. I along with other Americans watched the live feeds. The world s watching  I SEE STUPID PEOPLE (@ICSTUPIDPEOPLE_) January 22, 2017@FoxNews @seanspicer what an angry liar!  Jose E. Ralat (@Kiketron) January 22, 2017And so much more. A Twitter search for  Sean Spicer  reveals thousands of excoriating tweets.But Spicer likely doesn t care. He also said this in his  speech: We know that from the platform, where the president was sworn in to 4th street, holds about 250,000 people. From 4th Street to the media tent holds about 220,000, and the media tent to the Washington monument another 250,000 people. Yeah, that s still not one million people, let alone 1.8 million, Mr. Spicer. No wonder all of Twitter is on your back. Not only do the photographs and screencaps from the live feed prove you a liar, but you thought you could turn your lies into truth by yelling at the press. You, sir, are just as ridiculous as your boss.Watch him lie his ass off below, beginning at the 1:36:05 mark:Featured image by Alex Wong via Getty Images","subject":"News","date":"January 21, 2017","label":0},"truncated_cells":[]},{"row_idx":95,"row":{"Unnamed: 0":19443,"title":"BEST MELTDOWN OF 2016! TUCKER CARLSON BLASTS Senior “Writer” At Newsweek: “Was Trump In A Mental Hospital Or Not?…Answer The Question!” [VIDEO]","text":"When asked why they might have booed, he speculated that it was because Glenn was a Democrat:He just moved on, said \"maybe they'll come around.\" I think context was that Glenn was a democrat.  Kurt Eichenwald (@kurteichenwald) December 9, 2016Outspoken conservative and FOX News host Tucker Carlson confronted Kurt Eichenwald during his show. He touched on several subjects, but the one that sticks out the most, is the unfounded claim that Eichenwald made about Trump being in a mental hospital in 1999:Here s what the very liberal Washington Post had to say about Eichenwald s claim that Trump was in a mental hospital Kurt Eichenwald is an experienced investigative journalist, with a best-selling book to his credit and years of work at the New York Times, Vanity Fair and now Newsweek.There s no evidence that Trump was ever hospitalized for such a condition, and Eichenwald cited none.The tweet was quickly deleted from Eichenwald s account, though not before it received hundreds of retweets and  likes,  spreading it far and wide across the Twittersphere.After quite a bit of back and forth with the clearly embarrassed Newsweek Senior writer, Carlson finally let Eichenwald have it:  You re entirely entitled to your opinion, my only point is that t you should label yourself as you are which is an advocate. https://youtu.be/wJCuUu_1TNsFor the record, this is the image Eichenwald uses as his profile picture on Twitter:Seriously? Is everything about this clown fake? Even his picture looks fake. It s time to drain the swamp of these arrogant  journalists  promoting fake news stories for mainstream sources who are attempting to label all conservative news sources as  fake.","subject":"left-news","date":"Dec 15, 2016","label":0},"truncated_cells":[]},{"row_idx":96,"row":{"Unnamed: 0":5927,"title":"Tensions simmer below surface as Trump, Republicans map strategy","text":"When President Donald Trump was elected last November, Republican lawmakers enthusiastically joined his call to rewrite the tax code and dismantle Obamacare in the first 100 days of his presidency. But as congressional Republicans gathered for an annual policy retreat in Philadelphia on Wednesday, the 100-day goal morphed into 200 days. As the week wore on, leaders were saying it could take until the end of 2017 - or possibly longer - for passage of final legislation. Trump had a different idea when he spoke to lawmakers in Philadelphia, telling them: Enough talk. Time to deliver. The divergent views on the timetable were among many indications of tensions that simmered just below the surface at the three-day Republican retreat. Before the cameras, Trump and Republicans sought to convey an image of a happy, unified family, playing down differences over tax policy, whether to reinstate torture interrogation techniques and investigating 2016 election fraud. And clearly there is none of the open warfare that has sometimes erupted among Republicans, such as when Senator Ted Cruz infuriated many of his colleagues by leading a standoff over Obamacare that partially shut down the government in 2013. But barely visible in Philadelphia, there are potential flashpoints of disagreement within the Republican rank-and-file in Congress as well as between Republican lawmakers and the unorthodox new president. These include how and when to replace Obamacare if Republicans succeed in their quest to repeal it; how to revamp the multi-layered tax code, whether to build a wall on the U.S. border with Mexico and the nature of the U.S. relationship with Russia. When it comes to tax reform, senior congressional aides said the spring of 2018 might be a more likely time than this year for the passage of legislation. Republican lawmakers lavished praise on Trump in public. In dozens of interviews, many said they felt he would be an energetic champion of issues they cared about. But some also voiced fears that his big agenda would drive up deficits and said they were still searching for details on his plans. Several Republican lawmakers and aides said they were wary of the cost of his plan to build a wall on the border with Mexico. Republican leaders have said the wall proposal under discussion would cost $12 billion to $15 billion cost but some congressional aides say it could end up easily topping $20 billion. Republican Representative Will Hurd, whose Texas district partially borders Mexico, went a step further, calling the wall an ineffective tool for stopping illegal immigration. Others warned a border adjustment tax on foreign goods to pay for that wall could hurt U.S. companies’ profits, raise costs for American consumers and spark retaliation by foreign trading partners. Some lawmakers also worry that some of their constituents could be at risk of losing healthcare coverage if the push to repeal Obamacare moves too quickly. Republican Representative Tom Cole said rank-and-file lawmakers have an incentive to fall in line behind Trump. “You don’t want to be the reason why we weren’t successful in getting these things done,” he said. Still, Cole said Republicans are taking stock of the potential cost of the biggest items on Trump’s agenda such as the wall, infrastructure projects, tax cuts and beefing up military spending. “I think they worry about it,” Cole said.  Following Trump’s speech to the lawmakers on Thursday, Senator James Risch said that no decisions had been made on the replacement of Obamacare, a complex law that has expanded healthcare insurance to millions of Americans. “It’s going to take a while to resolve it,” Risch said. Asked by reporters whether Republicans had a clear idea of what Trump would like to replace Obamacare with, Risch responded, “In detail, no.”","subject":"politicsNews","date":"January 27, 2017 ","label":1},"truncated_cells":[]},{"row_idx":97,"row":{"Unnamed: 0":6407,"title":"Donald Trump Hints At Making The Crypt Keeper His Vice President","text":"Six years ago a little-known governor from Arizona skyrocketed to fame in the Republican Party by attacking immigrants and now Donald Trump is hinting that she may be his vice presidential pick   it d be a match made in Hell.Former Governor Jan Brewer signed SB 1070, the  Show Me Your Papers  bill, into law in the state and the GOP base fawned all over her. When she signed the xenophobic bill into law she said that she was doing it because she had to keep her state safe: We cannot sacrifice our safety to the murderous greed of drug cartels. We cannot stand idly by as drop houses, kidnappings, and violence compromise our quality of life. We cannot delay while the destruction happening south of our border   our international border creeps its way north. We in Arizona have been more than patient waiting for Washington to act, but decades of federal inaction and misguided policy have created a dangerous and unacceptable situation. Just like Trump, she lied and demonized the immigrant community in order to appease her hateful supporters. Just like Trump, she used some of the most vulnerable people in the country as a political stepping stone. So, with that in mind, it isn t very surprising that Trump hinted at Brewer being his running mate during an interview with Fox s Greta van Susteren. The On the Record host the Republican presidential candidate if any women were on his list and he said, yes : Jan Brewer has been fantastic. She has been so fantastic. You know I won so big, her territory, we won so big. And she is a fabulous woman. Fabulous? Fantastic? Not even.Jan Brewer is a vile human being and there is nothing  fabulous  about her. The only thing that she has going for her is that she was the governor of a red state and she is as big a fear-monger as Trump. I almost hope the billionaire loudmouth does pick Governor Crypt Keeper as his running mate, his chances of winning the election will plummet even further.Featured image via Andrew H. Walker/Getty Images","subject":"News","date":"May 12, 2016","label":0},"truncated_cells":[]},{"row_idx":98,"row":{"Unnamed: 0":7922,"title":"Watch Bernie Sanders DESTROY Republican Ranting About ‘Homos’ In The Military","text":"Newly unearthed video shows Bernie Sanders giving a hatemongering Republican representative a piece of his mind for referring to  homos  serving in the military.The video, from 1995, shows then Rep. Bernie Sanders taking to the floor in the House of Representatives in response to the slur from Republican Rep. Duke Cunningham.Cunningham used the term when he said,  Is there any shocking doubt, the same people that would vote to cut defense $177 billion, the same ones that would put homos in the military, the same ones that would not fund BRAC, the same ones that would not clean up  Then Sanders cut him short:https://www.facebook.com/HuffingtonPost/videos/10153689923086130/ My ears may have been playing a trick on me, but I thought I heard the gentleman a moment ago say something quote unquote about homos in the military,  Sanders said.  Was I right in hearing that expression? Absolutely,  Cunningham responded.  Putting homosexuals in the military. Was the gentleman referring to the thousands and thousands of gay people who have put their lives on the line in countless wars defending this country? Was that the groups of people that the gentleman was referring to? You have insulted thousands of men and women who have put their lives on the line,  Sanders continued.  I think they are owed an apology. Even conservative Republicans don t use language like that anymore (at least in public), but it is jarring to hear that kind of slur from a member on the floor of the House, just a little over twenty years ago.While Duke Cunningham didn t back down to Sanders, a decade after this exchange, karma caught up with him. Cunningham was arrested and charged with accepting at least $2.4 million in bribes and underreporting his taxable income. In 2005 he pleaded guilty to federal charges of conspiracy to commit bribery, mail fraud, wire fraud and tax evasion. He spent 2005-13 in prison.Featured image via screen capture","subject":"News","date":"February 22, 2016","label":0},"truncated_cells":[]},{"row_idx":99,"row":{"Unnamed: 0":2884,"title":"Trump Gets Revenge On Women’s March By Signing Executive Order That Will Kill A Bunch Of Women And Girls","text":"How mad is Trump that millions of women made him look like a fool? Mad enough to kill, apparently. While he can t order the executions of American women for defying him yet President Pussygrabber did the next best thing. He signed an executive order that will lead to the deaths of multitudes of women and girls worldwide.On Monday, The Donald continued the path of destruction he began with his first executive order attacking Obamacare by unleashing an assault on the women and girls of the world. One of Trump s growing number of executive orders reinstates the  global gag rule,  which blocks federal funding for international, nongovernmental organizations that provide or  promote  abortions.In short, if your organization were to partner with Planned Parenthood to inform girls and women across the globe about reproductive health like, say, the Clinton Foundation, people like Trump could argue that you are  promoting  abortion by mentioning it as a medically legitimate option.The policy was originally developed by President Ronald Reagan in 1984. Ever since then, Presidents who care about human rights like Obama and Clinton have been rescinding it. Republicans, however, being part of a party that combats women s rights at every turn, typically reinstate it.How harmful is it? Mother Jones reports:According to the Center for Reproductive Rights, women in poor countries suffer the most from this policy. A 2003 analysis found that the rule leads to unsafe abortions, which are the second-leading cause of death for women of reproductive age in Ethiopia and account for more than 40 percent of the maternal mortality rate in Kenya. Peru has one of the highest maternal mortality rates in Latin America, in part because of its high rate of clandestine abortions.The United States currently spends about $600 million annually on family planning and reproductive health programs in foreign countries. The Guttmacher Institute, a think tank that studies reproductive health care, estimates that a loss of this funding would translate to 38,000 more abortions. Marie Stopes International, one of USAID s biggest family planning partners, estimates that the global gag rule will lead to an additional 2.2 million abortions worldwide.Trump s order comes on the anniversary of Roe v. Wade and directly follows a nationwide three-million women march against Trump and his hate. This didn t go unnoticed in Trump s homeland of Twitterville:1/21: 2.5 million women march.1/22: 44th anniversary of Roe v. Wade1/23: Trump starts rolling back women's rightshttps://t.co/mqQwVonBQQ  Kate Black (@KateBlackDC) January 23, 2017Trump this weekend: 'Didn't see the point' for this Women's MarchTrump today: Reinstates Global Gag Rule, hurting women worldwide  Matt McDermott (@mattmfm) January 23, 2017This is the vindictive asshole's idea of punishment for the women's march, I presume  https://t.co/4830aPJIuB  Dina/Alex  (@SkulldelaCreme) January 23, 2017two days after the women's march and trump already reinstates the global gag rule .  Paige Calian (@paigecalz) January 23, 2017This is why we march Trump just reinstated the global gag rule on abortion and family planning. https://t.co/v7YLBOS32G via @voxdotcom  Daveon Coleman (@DaveonMarjan) January 23, 2017I'd bet my life that this is 100 percent retaliation for the Womens March https://t.co/yin1QVEveM#WomensMarch  George D. (@xdelmar59) January 23, 2017Trump reinstates the gag rule = \"revenge\" on the women's march. I think it is clearer than ever that his first impulse is revenge.  Gwendolyn Ann Smith (@gwenners) January 23, 2017millions of women around the world march in part for reproductive rights and two days later trump reinstates the global gag rule  nasty woman (@kaarahoffmaan) January 23, 2017It's pretty clear that Trump reinstating the Global Gag Rule is directly in reaction to the Women's March that took place around the world.  Sepie (@sepiemoini) January 23, 2017Was this retaliation? Well,  many people are saying including a former British spy that Trump once paid some nice Russian ladies to pee on a bed for him because Obama had slept there at one point. Past that, he has displayed an almost impressive level of vindictiveness in all of his dealings, ever. Unfortunately, this is exactly the sort of thing we can expect from a small-minded, thin-skinned, bigoted bully who was handed too much power by a minority of the population and over the protests of more people than he was able to attract to his inauguration.Be sure to spend every day telling him to go fuck himself. It s the only way we re going to get through this.Featured image by Joe Raedle via Getty Images/screengrab","subject":"News","date":"January 23, 2017","label":0},"truncated_cells":[]}],"num_rows_total":30000,"num_rows_per_page":100,"partial":false}